<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">CONFIGURACI&Oacute; D'ENTITAT</h1>
<p>
	En la pantalla de<i>' Configuraci&oacute; d'entitat</i>' es poden gestionar configuracions relatives a una entitat, tant a nivell de Gestor de Tr&agrave;mits, com d'Assistent de Tramitaci&oacute;.<br><br>
	Aquesta pantalla permet la configuraci&oacute; de particularitats per a una entitat.<br><br>
	El manteniment de les configuracions d'entitat l'haur&agrave; de dur a terme un usuari amb rol '<i>Administrador d'entitat</i>' i el rol de l'entitat corresponent.
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	GESTOR DE TRÀMITS
	<ul>
		<li><span class="nombreCampo">Logo d'entitat (Gestor de tr&agrave;mits):</span> permet incorporar una imatge que es mostrar&agrave; com a logo de l'entitat en el Gestor de Tr&agrave;mits (SISTRAGESBACK)</li>
	</ul>
</p>
<p>
	ASISTENT TRAMITACIÓ
	<ul>
		<li>
			<span class="nombreCampo">Propietats</span>
			<ul>
				<li><span class="nombreCampo">Logo d'entitat (Assistent de tramitaci&oacute;):</span> permet incorporar una imatge que es mostrar&agrave; com a logo de l'entitat en l'Assistent de Tramitaci&oacute; (SISTRAMIT)</li>
				<li><span class="nombreCampo">CSS d'entitat:</span> permet incorporar un full d'estils (CSS) per a la particularitzaci&oacute; dels estils de l'entitat en l'Assistent de Tramitaci&oacute; (SISTRAMIT)</li>
				<li><span class="nombreCampo">URL Carpeta Ciutadana:</span> URL de la Carpeta Ciutadana de l'entitat. L'Assistent de Tramitaci&oacute; utilitzar&agrave; aquesta URL per a la redirecci&oacute; del navegador en determinades situacions (cancel·laci&oacute; de tr&agrave;mit, etc.)</li>
				<li><span class="nombreCampo">Días preregistro:</span> FUNCIONALITAT NO IMPLEMENTADA</li>
				<li><span class="nombreCampo">Permet valorar els tràmits:</span> Indica si a l'acabar tràmit es realitza enquesta de valoració </li>
			</ul>
		</li>
		<li>
			<span class="nombreCampo">Ajuda</span>
			<ul>
				<li><span class="nombreCampo">Email:</span> permet activar/desactivar, a l'apartat d'ajuda de l'Assistent de Tramitaci&oacute;, el suport per correu electr&ograve;nic a trav&eacute;s de l'email de contacte gen&egrave;ric</li>
				<li><span class="nombreCampo">Tel&egrave;fon de suport:</span> permet activar/desactivar, a l'apartat d'ajuda de l'Assistent de Tramitaci&oacute;, el suport per via telef&ograve;nica. Es mostrar&agrave; el n&uacute;mero de tel&egrave;fon indicat en el camp de text.</li>
				<li><span class="nombreCampo">Url de suport t&egrave;cnic:</span> permet activar/desactivar, a l'apartat d'ajuda de l'Assistent de Tramitaci&oacute;, el suport a trav&eacute;s d'una web. Es mostrar&agrave; la URL indicada en el camp de text.</li>
				<li><span class="nombreCampo">Formulari de contacte:</span> permet activar/desactivar, a l'apartat d'ajuda de l'Assistent de Tramitaci&oacute;, el suport a trav&eacute;s d'un formulari web. A trav&eacute;s del bot&oacute; existent s'accedeix a la <a href="AyudaServlet?lang=ca&id=formularioSoporte">fitxa</a> de gesti&oacute; d'opcions de suport del formulari</li>
			</ul>
		</li>
		<li>
			<span class="nombreCampo">Peu de pàgina</span>
			<ul>
				<li><span class="nombreCampo">Contacte (HTML):</span> informaci&oacute; de contacte que es mostrar&agrave; al peu de p&agrave;gina de l'Assistent de Tramitaci&oacute; per als tr&agrave;mits de l'entitat</li>
				<li><span class="nombreCampo">Mapa Web:</span> URL amb la qual s'enlla&ccedil;ar&agrave; el Mapa Web que es mostrar&agrave; al peu de p&agrave;gina de l'Assistent de Tramitaci&oacute; per als tr&agrave;mits de l'entitat</li>
				<li><span class="nombreCampo">Aviso Legal:</span> URL amb la qual s'enlla&ccedil;ar&agrave; l'Av&iacute;s Legal que es mostrar&agrave; al peu de p&agrave;gina de l'Assistent de Tramitaci&oacute; per als tr&agrave;mits de l'entitat</li>
				<li><span class="nombreCampo">RSS:</span> URL amb la qual s'enlla&ccedil;ar&agrave; l'apartat RSS que es mostrar&agrave; al peu de p&agrave;gina de l'Assistent de Tramitaci&oacute; per als tr&agrave;mits de l'entitat</li>
			</ul>
		</li>
		<li>
			<span class="nombreCampo">Xarxes socials</span>
			<ul>
				<li><span class="nombreCampo">Youtube:</span> URL a la qual s'associar&agrave; la icona de Youtube presentat en l'apartat Xarxes Socials que es mostrar&agrave; al peu de p&agrave;gina de l'Assistent de Tramitaci&oacute; per als tr&agrave;mits de l'entitat</li>
				<li><span class="nombreCampo">Instagram:</span> URL a la qual s'associar&agrave; la icona d'Instagram presentat en l'apartat Xarxes Socials que es mostrar&agrave; al peu de p&agrave;gina de l'Assistent de Tramitaci&oacute; per als tr&agrave;mits de l'entitat</li>
				<li><span class="nombreCampo">Twitter:</span> URL a la qual s'associar&agrave; la icona de Twitter presentat en l'apartat Xarxes Socials que es mostrar&agrave; al peu de p&agrave;gina de l'Assistent de Tramitaci&oacute; per als tr&agrave;mits de l'entitat</li>
				<li><span class="nombreCampo">Facebook:</span> URL a la qual s'associar&agrave; la icona de Facebook presentat en l'apartat Xarxes Socials que es mostrar&agrave; al peu de p&agrave;gina de l'Assistent de Tramitaci&oacute; per als tr&agrave;mits de l'entitat</li>
			</ul>
		</li>
		<li>
			<span class="nombreCampo">Esmena</span>
			<ul>
				<li>FUNCIONALITAT NO IMPLEMENTADA</li>
			</ul>
		</li>
		<li>
			<span class="nombreCampo">Lliurament presencial</span>
			<ul>
				<li>FUNCIONALITAT NO IMPLEMENTADA</li>
			</ul>
		</li>
		<li>
			<span class="nombreCampo">LOPD</span>
			<ul>
				<li><span class="nombreCampo">LOPD Introducció:</span> breu text informatiu, amb suport HTML, relatiu a protecci&oacute; de dades personals que es mostrar&agrave; a la passa "Cal Saber" dels tr&agrave;mits de l'entitat (FUNCIONALITAT NO IMPLEMENTADA)</li>
				<li><span class="nombreCampo">LOPD:</span> text informatiu, amb suport HTML, relatiu a protecci&oacute; de dades personals que es mostrar&agrave; a la passa "Cal Saber" dels tr&agrave;mits de l'entitat en prémer més informació</li>
			</ul>
		</li>
		<li>
			<span class="nombreCampo">Registre</span>
			<ul>
				<li><span class="nombreCampo">Establir dades registre de forma centralitzada:</span> Permet establir oficina registre de forma centralitzada</li>
				<li><span class="nombreCampo">Amaga documentació en Pas Desar:</span> Permet amagar la llista de documents en el Pas Desar</li>


			</ul>
		</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Desar</span>: permet desar totes les configuracions de l'entitat que hagin estat modificades.</li>
		<li><span class="boton">Refrescar m. cau</span>: permet refrescar la mem&ograve;ria cau de manera que els canvis es vegin reflectits en l'Assistent de Tramitaci&oacute;. Una vegada pitjat el bot&oacute;, els canvis triguen a reflectir-se en l'Assistent de Tramitaci&oacute; al voltant d'un minut</li>
	</ul>
</p>
</body>
</html>