<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">Edició parámetres domini</h1>
<p>
	A la pantalla de '<i>Par&#224;metres de domini</i>' es permet l'alta, l'edici&oacute; o la baixa d'un paràmetre de domini. A l'afegir un paràmetre, ens apareixeran els següents camps:<br>

</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Par&#224;metre:</span> Par&#224;metre del domini. Apareixer&#224; un desplegable que indicar&#224; quins s&#243;n els par&#224;metres que necessita que requereix el domini.</li>
		<li><span class="nombreCampo">Valor:</span> Valor que tindr&#224; el par&#224;metre seleccionat.</li>
		<li><span class="nombreCampo">Tipus:</span> El tipus es la forma en la que agafarà valor el par&#224;metre seleccionat. Pot ser d'un dels 4 tipus que es mostren a continuaci&#243;:</li>
		<p>
			<ul>
				<li><span class="nombreCampo">Constant:</span> Si el tipus de par&#224;metre seleccionat &#233;s de tipus ‘Constant’, el par&#224;metre agafar&#224; com a valor el que hi hagi en el camp ‘Valor’. &#201;s a dir, el valor del par&#224;metre que se li enviar&#224; al domini ser&#224; el que s’indiqui en el camp ‘Valor’.</li>
				<li><span class="nombreCampo">Camp:</span> Si el tipus de par&#224;metre seleccionat &#233;s de tipus ‘Camp’, el par&#224;metre agafar&#224; el valor del camp de text que tingui l’identificador igual al ‘Valor’ d’aquest par&#224;metre.</li>
				<li><span class="nombreCampo">Par&#224;metre:</span> Si el tipus de par&#224;metre seleccionat &#233;s de tipus ‘Par&#224;metre’, el par&#224;metre agafar&#224; el valor del par&#224;metre que haur&#224; d’estar pr&#232;viament definit en l’script de ‘Par&#224;metres d’obertura del formulari’ i que s’indicar&#224; en el camp ‘Valor’</li>
				<li><span class="nombreCampo">Sessi&#243;:</span> Si el tipus de par&#224;metre seleccionat &#233;s de tipus ‘Sessi&#243;’, en el camp ‘Valor’ apareixer&#224; una llista desplegable amb les opcins de dades de la Sessi&#243; que es poden agafar com a valor. En aquest cas doncs, el valor es selecciona d’una llista desplegable i no s’introdueix pel desenvolupador de tr&#224;mits.</li>
			</ul>
		</p>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Desar</span>: permet confirmar l'alta de l'annex sempre que s'hagin consignat els camps m&iacute;nims obligatoris.</li>
		<li><span class="boton">Cancel&middot;lar</span>: tanca la pantalla sense desar els canvis.</li>
	</ul>
</p>
</body>
</html>