<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">MANTENIMENT DE PASSA REGISTRAR FORMULARI</h1>
<p>
	En la pantalla de<i>' Manteniment de passa Registrar formulari</i>' pot gestionar les opcions relatives al registre de la sol&middot;licitud.<br>
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Dades de dest&iacute;:</span> en aquest apartat s'han de consignar les dades de destinaci&oacute; de les sol&middot;licituds vinculades a la versi&oacute; del tr&agrave;mit. </li>
		<ul class="detalle">
		<li><span class="boton">Oficina de registre:</span> oficina del registre electr&ograve;nic sobre el qual es realitzar&agrave; el registre de la sol&middot;licitud.</li>
		<li><span class="boton">Llibre de registre:</span> llibre de registre, de l'oficina de registre seleccionada, sobre la qual es realitzar&agrave; l'anotaci&oacute; registral d'entrada de la sol&middot;licitud.</li>
		<li><span class="boton">Tipus d'assumpte:</span> tipus d'assumpte que s'especificar&agrave; en realitzar l'anotaci&oacute; registral sobre el registre electr&ograve;nic.</li>
		<li><span class="boton">Establir dades de dest&iacute;:</span> script que permet establir din&agrave;micament els par&agrave;metres de destinaci&oacute; descrits anteriorment. A m&eacute;s permet establir el n&uacute;mero d'expedient (seria obligatori per a tr&agrave;mits que no s&oacute;n d'inici).</li>
		</ul>
		<li><span class="nombreCampo">Instruccions de tramitaci&oacute; (HTML):</span> text multiidioma, amb suport HTML, que permet consignar informaci&oacute; d'inter&egrave;s per al ciutad&agrave; que es mostrar&agrave; en l'assistent, a la passa Registrar.</li>
		<li><span class="nombreCampo">Instruccions de lliurament presencial (HTML):</span>NO IMPLEMENTAT</li>
		<li><span class="nombreCampo">Instruccions d'esmena:</span>NO IMPLEMENTAT</li>
		<li><span class="nombreCampo">Establir presentador:</span> script que permet indicar les dades de la persona f&iacute;sica o jur&iacute;dica que presenta la sol&middot;licitud. Per a tramitacions autenticades, si el script no t&eacute; contingut, es prendr&agrave; com a presentador l'usuari autenticat. Per a tramitacions no autenticades ser&agrave; necessari consignar la persona presentadora.</li>
		<li><span class="nombreCampo">Representaci&oacute;:</span> configuraciones y restricciones relativas a la aportaci&oacute;n electr&oacute;nica del documento por parte del ciudadano:</li>
		<ul class="detalle">
		<li><span class="boton">Admet representaci&oacute;:</span> <i>check</i> per a indicar si el tr&agrave;mit permet representaci&oacute;. &Eacute;s necessari que estigui marcat perqu&egrave; es puguin autenticar en el tr&agrave;mit amb un certificat de representant.</li>
		<li><span class="boton">Establir representat:</span> Script per establir les dades del representant i del representat. Per defecte, si no s'omple aquest script, les dades que s'enviaran a REGWEB3 seran les dades provinents del certificat. Per a m&eacute;s informaci&oacute;, clicau <a href="AyudaServlet?id=definicionScriptRegistroTabla&lang=ca">aqu&iacute;</a>.</li>
		<li><span class="boton">Valida representaci&oacute;:</span> <i>check</i> que permet indicar si s'ha de validar la representaci&oacute;, en cas d'haver-la. (NO IMPLEMENTADA)</li>
		</ul>
		<li><span class="nombreCampo">Permet registrar:</span> script que permet realitzar validacions pr&egrave;vies al registre d'una sol&middot;licitud. Si aquestes validacions no se satisfan, es podr&iacute; impedir el registre de la sol&middot;licitud.</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Desar</span>: tanca la pantalla desant els canvis.</li>
		<li><span class="boton">Cancel&middot;lar</span>: tanca la pantalla sense desar els canvis.</li>
	</ul>
</p>
</body>
</html>
