<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">PASSA PAGAR TAXA</h1>
<p>
	A la pantalla de '<i>Passa Pagar Taxa</i>' es gestionen les taxes de la versi&oacute; del tr&agrave;mit. Es permet l'alta, baixa i edici&oacute; de documents de tipus taxa, aix&iacute; com l'ordenaci&oacute; d'aquests per a la seva presentaci&oacute; al ciutad&agrave; en l'assistent de tramitaci&oacute;.<br>
	El llistat de taxes incloses en la versi&oacute; es presenta paginat, podent-se seleccionar el nombre d'elements per p&agrave;gina a mostrar.
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Nou</span>: pitjant el bot&oacute; s'obrir&agrave; la <a href="../../ayuda/ca/definicionVersionPagarTasasDialog.html">fitxa</a> que crear un document de tipus taxa.</li>
		<li><span class="boton">Editar</span>: pitjant el bot&oacute; s'obrir&agrave; la <a href="../../ayuda/ca/definicionVersionPagarTasasDialog.html">fitxa</a> per a l'edici&oacute; de les configuracions de la taxa seleccionada.</li>
		<li> <span class="boton">Eliminar</span>: pitjant el bot&oacute; s'eliminar&agrave; la taxa que s'hagi seleccionat pr&egrave;viament en el llistat. Previ a l'eliminaci&oacute; se sol&middot;licitar&agrave; confirmaci&oacute; a l'usuari.</li>
		<li> <span class="boton">Pujar</span>: aquest bot&oacute; permet pujar la posici&oacute; de la taxa seleccionada en el llistat de taxes presentades.</li>
		<li> <span class="boton">Baixar</span>: aquest bot&oacute; permet pujar la posici&oacute; de la taxa seleccionada en el llistat de taxes presentades.</li>
	</ul>
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Identificador:</span> codi un&iacute;voc que identifica la taxa en l'aplicaci&oacute;. Qualsevol refer&egrave;ncia a la taxa en els scripts de la versi&oacute; es realitzar&agrave; utilitzant aquest codi.</li>
		<li><span class="nombreCampo">Descripci&oacute;:</span> text multiidioma que permet establer la denominaci&oacute; de la taxa en l'assistent de tramitaci&oacute;.</li>
		<li><span class="nombreCampo">Obligatorietat:</span> indica l'obligatorietat del pagament de la taxa per part del ciutad&agrave;.</li>
		<li><span class="nombreCampo">Tipus:</span> indica el tipus de pagament que permet la taxa. El pagament podr&agrave; ser electr&ograve;nic, presencial o tots dos.</li>
	</ul>
</p>
</body>
</html>