<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">PASSA EMPLENAR FORMULARI</h1>
<p>
	En la pantalla de<i>' Passa Emplenar Formulari</i>' es gestionen els formularis de la versi&oacute; del tr&agrave;mit. Es permet l'alta, baixa i edici&oacute; de documents de tipus formulari, aix&iacute; com l'ordenaci&oacute; dels mateixos per a la seva presentaci&oacute; al ciutad&agrave; en l'assistent de tramitaci&oacute;.<br>
	El llistat de formularis utilitzats per la versi&oacute; &eacute;s presenta paginat, podent-se seleccionar el nom d'elements per p&agrave;gina a mostrar.
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Nou</span>: pitjant en el bot&oacute; s'obrir&agrave; la <a href="../../ayuda/ca/definicionVersionRellenarDialog.html">fitxa</a> que crear un document de tipus formulari.</li>
		<li><span class="boton">Editar</span>: pitjant en el bot&oacute; s'obrir&agrave; la <a href="../../ayuda/ca/definicionVersionRellenarDialog.html">fitxa</a> per a l'edici&oacute; de les configuracions del formulari seleccionat.</li>
		<li> <span class="boton">Eliminar</span>: pitjant aquest bot&oacute; s'eliminar&agrave; el formulari que s'hagi seleccionat pr&egrave;viament en el llistat. Previ a l'eliminaci&oacute; se sol&middot;licitar&agrave; confirmaci&oacute; a l'usuari.</li>
		<li> <span class="boton">Pujar</span>: aquest bot&oacute; permet pujar la posici&oacute; del formulari seleccionat en el llistat de formularis presentats.</li>
		<li> <span class="boton">Baixar</span>: aquest bot&oacute; permet baixar la posici&oacute; del formulari seleccionat en el llistat de formularis presentats.</li>
	</ul>
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Identificador:</span> codi un&iacute;voc que identifica al formulari en l'aplicaci&oacute;. Qualsevol refer&egrave;ncia al formulari en els scripts de la versi&oacute; es realitzar&agrave; utilitzant aquest codi</li>
		<li><span class="nombreCampo">Descripci&oacute;:</span> text multiidioma de presentaci&oacute; del formulari en l'assistent de tramitaci&oacute;. Aquesta ser&agrave; la denominaci&oacute; del formulari per al tramitador.</li>
		<li><span class="nombreCampo">Tipus:</span> tipus de formulari, que pot ser intern o extern. Per defecte els formularis s&oacute;n interns. Els formulari externs es refereixen a aquells implementats amb gestors de formularis externs.</li>
	</ul>
</p>
</body>
</html>