<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">MANTENIMENT PROPIETATS DE VERSI&Oacute;</h1>
<p>
	En la pantalla de <i>'Manteniment de propietats de versi&oacute;</i>' pot mantenir les propietats de la versi&oacute; d'un tr&agrave;mit que no fan refer&egrave;ncia a un pas espec&iacute;fic d'aquesta.<br>
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Autenticaci&oacute;:</span> permet establir el tipus d'autenticaci&oacute; que suportar&agrave; la versi&oacute; del tr&agrave;mit. Els possibles tipus s&oacute;n:</li>
		<ul class="detalle">
		<li><span class="boton">Autenticat:</span> casella que permet habilitar l'acc&eacute;s autenticat. Els m&egrave;todes d'autenticaci&oacute; oferts vindran determinats pel plugin de login utilitzat.</li>
		<li><span class="boton">Nivell QAA:</span> en cas d'acc&eacute;s autenticat, permet definir el nivell d'assegurament en la qualitat de l'autenticaci&oacute; (QAA). Aquest valor es fixa t&iacute;picament sobre la base de les dades que es tracten i a la classificaci&oacute; de seguretat seguint les recomanacions del ENS.</li>
		<li><span class="boton">Sense autenticaci&oacute;:</span> casella que permet habilitar l'acc&eacute;s sense autenticaci&oacute;. En aquest tipus d'acc&eacute;s l'assistent de tramitaci&oacute; facilitar&agrave; una clau de tramitaci&oacute; al ciutad&agrave; que li permetr&agrave;, durant un temps, reprendre la tramitaci&oacute; en cas de deixar-la inacabada.</li>
		</ul>
		<li><span class="nombreCampo">Idioma:</span> permet, mitjan&ccedil;ant caselles de selecci&oacute;, establir els idiomes en els quals estar&agrave; disponible la versi&oacute; del tr&agrave;mit. Durant el disseny del tr&agrave;mit ser&agrave; obligatori consignar els textos multiidioma en tots aquells idiomes que s'hagin habilitat per a la versi&oacute;</li>
		<li><span class="nombreCampo">Persist&egrave;ncia:</span> permet establir si les tramitacions inacabades podran ser recuperades per a completar-se. Si aquesta casella est&agrave; desmarcada un ciutad&agrave; no podr&agrave; recuperar una tramitaci&oacute; inacabada si abandona l'assistent de tramitaci&oacute;. La persist&egrave;ncia permet a m&eacute;s les configuracions seg&uuml;ents:</li>
		<ul class="detalle">
		<li><span class="boton">Sense l&iacute;mit:</span> si es marca aquesta opci&oacute; la persist&egrave;ncia, en cas d'estar habilitada, no t&eacute; l&iacute;mit temporal. El l&iacute;mit temporal m&agrave;xim vindr&agrave; marcat per la data fi de termini del tr&agrave;mit.</li>
		<li><span class="boton">Per dies:</span> permet indicar el nombre de dies, en cas d'estar habilitada la persist&egrave;ncia, que es mantindran les tramitacions en persist&egrave;ncia.</li>
		<li><span class="boton">Nre. dies:</span> permet establir una data de final fins la qual es mostrar&agrave; el missatge. Si no es consigna valor el missatge aplicar&agrave; en qualsevol moment. El l&iacute;mit temporal m&agrave;xim vindr&agrave; marcat per la data fi de termini del tr&agrave;mit.</li>
		</ul>
		<li><span class="nombreCampo">Script de personalizaci&oacute;:</span> script que permet modificar din&agrave;micament el t&iacute;tol del tr&agrave;mit i el seu termini d'inici i fi. Tamb&eacute; es pot emprar aquest script per a establir una validaci&oacute; d'inici de tr&agrave;mit.</li>
		<li><span class="nombreCampo">Script de par&agrave;metres inicials:</span> script permet afegir par&agrave;metres d'inici del tr&agrave;mit (per defecte tindr&agrave; els par&agrave;metres de la url).</li>

	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Desar</span>: tanca la pantalla desant els canvis.</li>
		<li><span class="boton">Cancel&middot;lar</span>: tanca la pantalla sense desar els canvis.</li>
	</ul>
</p>
</body>
</html>