<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">GESTI&Oacute; D'ENTITATS</h1>
En la pantalla de '<i>Gesti&oacute; d'entitats</i>' pot gestionar l'alta o baixa d'entitats, aix&iacute; com realitzar consultes o modificacions de les dades de les entitats ja existents. Aquesta pantalla permet tamb&eacute; la realitzaci&oacute; de cerques filtrades d'entitats.<br><br>
En la fitxa de detall de les entitats els camps obligatoris es presenten amb un asterisc *.
<h2 class="stgH2">OPERATIVA</h2>
El manteniment de les entitats requereix l'acc&eacute;s amb un usuari que disposi del rol de '<i>Superadministrador</i>'. Les accions disponibles s&oacute;n les seg&uuml;ents:
<ul>
<li><b>Cercar entitats</b>: introduint un text en el camp '<i>Cercar</i>' i prement el bot&oacute; amb la icona de la lupa es dur&agrave; a terme un filtratge de les entitats que continguin el text introdu&iuml;t. El criteri de cerca aplicar&agrave; en qualsevol dels camps de l'entitat. Posteriorment es visualitzaran els resultats de la cerca filtrant-ho en el llistat d'entitats.</li>
<li><b>Nova entitat</b>: prement en el bot&oacute; <span class="boton">Nou</span> s'obrir&agrave; la fitxa per donar d'alta una nova entitat en la qual haur&agrave; d'emplenar els camps m&iacute;nims so&#320;licitats.</li>
<li><b>Editar entitat</b>: seleccionant una entitat del llistat i prement en el bot&oacute; <span class="boton">Editar</span> s'obrir&agrave; la fitxa per poder realitzar les modificacions dels camps desitjats.</li>
<li><b>Eliminar entitat</b>: seleccionant una entitat del llistat i prement sobre el bot&oacute; <span class="boton">Eliminar</span> podr&agrave; suprimir una entitat existent. Previ a l'eliminaci&oacute; de l'entitat es mostrar&agrave; un missatge de confirmaci&oacute; de l'acci&oacute;.</li>
</ul>
Per desar els canvis realitzats (altes i modificacions) s'haur&agrave; de pr&eacute;mer el bot&oacute; <span class="boton">Desar</span>, en pr&eacute;mer es tancar&agrave; la fitxa de l'entitat.
Per sortir sense guardar els canvis realitzats, premer&agrave; el bot&oacute; <span class="boton">Cance&#320;lar</span>.
<h2 class="gttH2">DESCRIPCI&Oacute; DE CAMPS</h2>
<ul>
<li><span class="nombreCampo"><b>C&oacute;di DIR3</b>:</span> c&oacute;di DIR3 de l'entitat. </li>
<li><span class="nombreCampo"><b>Nom de l'entitat</b>:</span> nom de l'entitat.</li>
<li><span class="nombreCampo"><b>Activa</b>:</span> indicar&aacute; si l'entitat est&agrave; '<i>Activa</i>' dins de la plataforma de tramitaci&oacute; telem&agrave;tica.</li>
<li><span class="nombreCampo"><b>Rol de l'entitat</b>:</span> rol espec&iacute;fic que se li assignar&agrave; a l'entitat. Aquest rol ser&agrave; el requerit per un '<i>Administrador d'Entitat</i>' per dur a terme el manteniment d'aquesta entitat.</li>
</ul>
</body>
</html>