<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">GESTI&Oacute; D'ENTITATS</h1>
<p>
	En la pantalla de '<i>Gesti&oacute; d'entitats</i>' pot gestionar l'alta o baixa d'entitats, aix&iacute; com realitzar consultes o modificacions de les dades de les entitats ja existents. Aquesta pantalla permet tamb&eacute; la realitzaci&oacute; de cerques filtrades d'entitats.<br><br>
	El manteniment de les entitats requereix l'acc&eacute;s amb un usuari que disposi del rol de '<i>Superadministrador</i>'.
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">C&oacute;di DIR3:</span> c&oacute;di DIR3 de l'entitat. </li>
		<li><span class="nombreCampo">Nom de l'entitat:</span> nom de l'entitat.</li>
		<li><span class="nombreCampo">Activa:</span> indicar&aacute; si l'entitat est&agrave; '<i>Activa</i>' dins de la plataforma de tramitaci&oacute; telem&agrave;tica.</li>
		<li><span class="nombreCampo">Rol de l'entitat:</span> rol espec&iacute;fic que se li assignar&agrave; a l'entitat. Aquest rol ser&agrave; el requerit per un '<i>Administrador d'Entitat</i>' per dur a terme el manteniment d'aquesta entitat.</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Cercar</span>: introduint un text en el camp '<i>Cercar</i>' i prement el bot&oacute; amb la icona de la lupa es dur&agrave; a terme un filtratge de les entitats que continguin el text introdu&iuml;t. El criteri de cerca aplicar&agrave; en qualsevol dels camps de l'entitat. Posteriorment es visualitzaran els resultats de la cerca filtrant-ho en el llistat d'entitats.</li>
		<li><span class="boton">Nou</span>: prement en el bot&oacute; s'obrir&agrave; la <a href="../../ayuda/ca/entidadDialog.html">fitxa</a> per donar d'alta una nova entitat en la qual haur&agrave; d'emplenar els camps m&iacute;nims so&#320;licitats.</li>
		<li><span class="boton">Editar</span>: seleccionant una entitat del llistat i prement en el bot&oacute; s'obrir&agrave; la fitxa per poder realitzar les modificacions dels camps desitjats.</li>
		<li> <span class="boton">Eliminar</span>: seleccionant una entitat del llistat i prement sobre el bot&oacute; podr&agrave; suprimir una entitat existent. Previ a l'eliminaci&oacute; de l'entitat es mostrar&agrave; un missatge de confirmaci&oacute; de l'acci&oacute;.</li>
	</ul>
</p>
</body>
</html>