<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">FONTS DE DADES D'ENTIDAT</h1>
<p>
	En la pantalla de<i>' Fonts de dades d'entitat</i>' es pot gestionar tant l'alta o baixa de fonts de dades de l'entitat, com realitzar consultes o modificacions damunt les fonts de dades ja existents.<br><br>
	Aquesta pantalla permet la realitzaci&oacute; de cerques filtrades de fonts de dades.<br><br>
	El manteniment de les fonts de dades l'ha de realitzar un usuari que disposi del rol '<i>Administrador d'entitat</i>' i addicionalment del rol de l'entitat corresponent.
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Identificador:</span> codi &uacute;nic identificador de la font de dades. Aquest ser&agrave; el codi a referenciar en un domini si es desitja consumir aquesta font de dades.</li>
		<li><span class="nombreCampo">Descripci&oacute;:</span> text descriptiu de la font de dades. Ha de ser un petit text il&middot;lustratiu de l'objecte de la font de dades.</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Cercar</span>: introduint un text en el camp '<i>Cercar</i>' i pitjant el bot&oacute; amb la icona de la lupa es dur&agrave; a terme un filtrat de les fonts de dades que continguin el text introdu&iuml;t. El criteri de cerca aplicar&agrave; en qualsevol dels camps de la font mostrats en el llistat. Posteriorment es visualitzaran els resultats de la cerca filtrant-los en el llistat de fonts de dades.</li>
		<li><span class="boton">Nou</span>: pitjant el bot&oacute; s'obrir&agrave; la <a href="AyudaServlet?lang=ca&id=fuenteDialog">fitxa</a> per a donar d'alta una nova font de dades, en el qual s'hauran d'emplenar els camps m&iacute;nims sol&middot;licitats.</li>
		<li><span class="boton">Editar</span>: seleccionant una font de dades del llistat i pitjant el bot&oacute; s'obrir&agrave; la fitxa per a poder realitzar les modificacions dels camps desitjats.</li>
		<li> <span class="boton">Eliminar</span>: seleccionant una font de dades del llistat i pitjant el bot&oacute; podr&agrave; suprimir una font de dades existent. De manera pr&egrave;via a l'eliminaci&oacute; de la font de dades es mostrar&agrave; un missatge de confirmaci&oacute; de l'acci&oacute;.</li>
		<li> <span class="boton">Dades</span>: seleccionant una font de dades del llistat i pitjant el bot&oacute; "Dades" es permetr&agrave; la inclusi&oacute; de dades per a la font.</li>
	</ul>
</p>
</body>
</html>