<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">MISSATGES D'AV&Iacute;S D'ENTITAT</h1>
<p>
	En la pantalla de<i>' Missatges d'av&iacute;s d'entitat</i>' es poden gestionar tant l'alta o baixa de missatges d'av&iacute;s per a l'entitat, com realitzar consultes o modificacions de sobre els missatges d'av&iacute;s ja existents. Els missatges d'av&iacute;s s&oacute;n uns missatges tipificats que seran mostrats al ciutad&agrave; en l'Assistent de Tramitaci&oacute; segons unes determinades circumst&agrave;ncies, que seran fixades en la propietat definici&oacute; del missatge.<br><br>
	Aquesta pantalla permet la realitzaci&oacute; de cerques filtrades de missatges d'av&iacute;s.<br><br>
	El manteniment dels missatges d'av&iacute;s d'entitat l'ha de realitzar un usuari que disposi del rol '<i>Administrador d'entitat</i>' i addicionalment del rol de l'entitat corresponent.
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Missatge d'av&iacute;s:</span> text multiidioma a mostrar per al missatge d'av&iacute;s definit. Aquest ser&agrave; el text que visualitzi el ciutad&agrave; des de l'Assistent de Tramitaci&ograve;</li>
		<li><span class="nombreCampo">Tipus:</span> tipologia del missatge d'av&iacute;s. La tipologia est&agrave; basada en tr&agrave;mits amb una caracter&iacute;stica determinada o en un llistat de tr&agrave;mits/versi&oacute; concret.</li>
		<li><span class="nombreCampo">Data inici:</span> data en la qual inicia l'aplicaci&oacute; del missatge d'av&iacute;s d'entitat.</li>
		<li><span class="nombreCampo">Data fi:</span> data en la qual deixa d'aplicar-se el missatge d'av&iacute;s d'entitat.</li>
		<li><span class="nombreCampo">Desactivar acc&eacute;s:</span> indica si a m&eacute;s de mostrar el missatge es desactiva l'acc&eacute;s al tr&agrave;mit.</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Cercar</span>: introduint un text en el camp '<i>Buscar</i>' i pitjant el bot&oacute; amb la icona de la lupa es portar&agrave; cap un filtrat dels missatges d'av&iacute;s que continguin el text introdu&iuml;t. El criteri de cerca aplicar&agrave; en qualsevol dels camps dels missatges d'av&iacute;s mostrats en el llistat. Posteriorment es visualitzaran els resultats de la cerca filtrant-los en el llistat de missatges d'av&iacute;s.</li>
		<li><span class="boton">Nou</span>: pitjant el bot&oacute; s'obrir&agrave; la <a href="AyudaServlet?lang=ca&id=mensajeAvisoDialog">fitxa</a> per a donar d'alta un nou missatge d'av&iacute;s, en el qual s'hauran d'emplenar els camps m&iacute;nims sol&middot;licitats.</li>
		<li><span class="boton">Editar</span>: seleccionant un missatge d'av&iacute;s del llistat i pitjant el bot&oacute; s'obrir&agrave; la fitxa per a poder realitzar les modificacions dels camps desitjats.</li>
		<li> <span class="boton">Eliminar</span>: seleccionant un missatge d'av&iacute;s del llistat i pitjant el bot&oacute; podr&agrave; suprimir una font de dades existent. De manera pr&egrave;via a l'eliminaci&oacute; del missatge d'av&iacute;s es mostrar&agrave; un missatge de confirmaci&oacute; de l'acci&oacute;.</li>
		<li> <span class="boton">Refrescar m. cau</span>: si canvia el valor d'algun missatge d'av&iacute;s haureu de pitjar aquest bot&oacute; perqu&egrave; s'apliquin els canvis realitzats.</li>
	</ul>
</p>
</body>
</html>