<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">PLUGINS</h1>
<p>
	En la pantalla de '<i>Plugins</i>' es pot gestionar tant l'alta o baixa de plugins com realitzar consultes o modificacions dels plugins ja existents. Els plugins tenen un &agrave;mbit d'aplicaci&Oacute;, global o entitat, que es refereix a si apliquen a nivell general d'aplicaci&oacute; o nom&eacute;s per l'entitat concreta. Cada tipus de plugin t&eacute; un &agrave;mbit d'aplicaci&oacute; concret.<br><br>
	Aquesta pantalla permet la realitzaci&oacute; de cerques filtrades de plugins.<br><br>
	El manteniment de plugins d'&agrave;mbit global l'ha de fer un usuari que disposi del rol de '<i>Superadministrador</i>', en canvi els plugins d'&agrave;mbit entitat hauran de ser mantinguts per un usuari amb rol '<i>Administrador d'entitat</i>' i el rol de l'entitat corresponent.
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Tipus de plugin:</span> tipologia del plugin</li>
		<li><span class="nombreCampo">Classname:</span> classname de la classe implementadora del plugin</li>
		<li><span class="nombreCampo">Descripci&oacute;:</span> text descriptiu de la implementaci&oacute; del plugin</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Cercar</span>: introduint un text en el camp '<i>Cercar</i>' i prement el bot&oacute; amb la icona de la lupa es dur&agrave; a terme un filtratge dels plugins que continguin el text introdu&iuml;t. El criteri de cerca aplicar&agrave; en qualsevol dels camps del plugin. Posteriorment es visualitzaran els resultats de la cerca filtrant-ho en el llistat de plugins.</li>
		<li><span class="boton">Nou</span>: prement en el bot&oacute; s'obrir&agrave; la <a href="AyudaServlet?lang=ca&id=pluginDialog">fitxa</a> per donar d'alta un nou plugin en el qual haur&agrave; d'emplenar els camps m&iacute;nims so&#320;licitats.</li>
		<li><span class="boton">Editar</span>: seleccionant un plugin del llistat i prement en el bot&oacute; s'obrir&agrave; la fitxa per poder realitzar les modificacions dels camps desitjats.</li>
		<li> <span class="boton">Eliminar</span>: seleccionant un plugin del llistat i prement sobre el bot&oacute; podr&agrave; suprimir un plugin existent. Previ a l'eliminaci&oacute; del plugin es mostrar&agrave; un missatge de confirmaci&oacute; de l'acci&oacute;.</li>
		<li> <span class="boton">Refrescar m. cau</span>: si canviau el valor d'alguna propietat haureu de pitjar aquest bot&oacute; per tal que s'apliquin els canvis realitzats.</li>
	</ul>
</p>
</body>
</html>