<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">ROLS I PERMISOS</h1>
<p>
	En la pantalla de<i>' Rols i permisos</i>' es poden gestionar tant l'alta o baixa de rols i permisos, com realitzar consultes o modificacions dels rols i permisos ja definits. L'objecte d'aquesta pantalla &eacute;s el manteniment dels rols que haur&agrave; de tenir un usuari per a tenir visibilitat sobre una &agrave;rea i els permisos que li atorguessin la facultat de realitzar determinades operacions sobre els elements de l'&agrave;rea. Aquests rols s&oacute;n complementaris als b&agrave;sics de l'aplicaci&oacute;.<br><br>
	Aquesta pantalla permet la realitzaci&oacute; de cerques filtrades de rols i permisos.<br><br>
	El manteniment dels rols i permisos l'ha de realitzar un usuari que disposi del rol '<i>Administrador d'entitat</i>' i addicionalment del rol de l'entitat corresponent.
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Rol/Principal:</span> nom del rol o usuari al qual s'associen els permisos.</li>
		<li><span class="nombreCampo">&Agrave;rea:</span> &agrave;rea sobre la qual apliquen els permisos.</li>
		<li><span class="nombreCampo">Descripci&oacute;:</span> text descriptiu dels permisos.</li>
		<li><span class="nombreCampo">Permisos:</span> permisos associats al rol/usuari.</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Cercar</span>: introduint un text en el camp '<i>Buscar</i>' i pitjant el bot&oacute; amb la icona de la lupa es dur&agrave; a terme un filtrat dels rols/usuaris que continguin el text introdu&iuml;t. El criteri de cerca aplicar&agrave; en qualsevol dels camps del rol/usuari. Posteriorment es visualitzaran els resultats de la cerca filtrant-los en el llistat de rols/usuaris.</li>
		<li><span class="boton">Nou</span>: pitjant el bot&oacute; s'obrir&agrave; la <a href="AyudaServlet?lang=ca&id=rolesPermisosDialog">fitxa</a> per a donar d'alta un nou rol/usuari en el qual s'hauran d'emplenar els camps m&iacute;nims sol&middot;licitats.</li>
		<li><span class="boton">Editar</span>: seleccionant un rol/usuari del llistat i pitjant el bot&oacute; s'obrir&agrave; la fitxa per a poder realitzar les modificacions dels camps desitjats.</li>
		<li> <span class="boton">Eliminar</span>: seleccionant un rol/usuari del llistat i pitjant el bot&oacute; podr&agrave; suprimir un rol/usuari existent. De manera pr&egrave;via a l'eliminaci&oacute; del rol/usuari es mostrar&agrave; un missatge de confirmaci&oacute; de l'acci&oacute;.</li>
	</ul>
</p>
</body>
</html>