<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">PREVISUALITZAR VERSI&Oacute;</h1>
<p>
	A la pantalla de '<i>Previsualitzar versi&oacute;</i>' es permet configurar les opcions per a la previsualizaci&oacute;, a l'assistent de tramitaci&oacute;, de la versi&oacute; del tr&agrave;mit.<br>
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Idioma:</span> permet seleccionar l'idioma en que es visualitzar&agrave; la versi&oacute; a l'assistent.</li>
		<li><span class="nombreCampo">Tr&agrave;mit:</span> desplegable en el qual s'ha d'indicar a quin tr&agrave;mit del cat&agrave;leg de procediments es vincula la versi&oacute; del tr&agrave;mit a previsualizar. Aquesta vinculaci&oacute; &eacute;s requerida per a la recuperaci&oacute; de dades del tr&agrave;mit del cat&agrave;leg de procediments.</li>
		<ul class="detalle">
		<li><span class="boton">Incorporats en SIA:</span> En marcar aquest check es carrega autom&agrave;ticament el llistat de Tr&agrave;mits de Procediments Administratius que tinguin un codi SIA associat, eliminant del llistat els marcats amb (S), per no estar inclosos en SIA i no poder previsualizarse.</li>
		<li><span class="boton">Vigents:</span> En marcar aquest check es carrega autom&agrave;ticament el llistat de Tr&agrave;mits de Procediments Administratius que estiguin vigents, segons la seva data de publicaci&oacute; i la de caducitat, eliminant del llistat els marcats amb (V), per no estar vigents actualment i no poder previsualizarse.</li>
		<li><span class="boton">P&uacute;blics:</span> En marcar aquest check es carrega autom&agrave;ticament el llistat de Tr&agrave;mits de Procediments Administratius que siguin P&uacute;blics (P) i no apareixeran els Interns (I) ni els Reservats (R).</li>
		<li><span class="boton">Simular tramitaci&oacute;:</span> En marcar aquest check no s'est&agrave; associant la previsualitzaci&oacute; a cap tr&agrave;mit del Cat&agrave;leg de Procediments, per la qual cosa no es podr&agrave; registrar.</li>
		</ul>
		<li><span class="nombreCampo">Par&agrave;metres:</span> llista de par&agrave;metres a afegir a la URL per a la previsualitzaci&oacute; del tr&agrave;mit. Respecte a aquests par&agrave;metres es pot dur a terme les operacions seg&uuml;ent:</li>
		<ul class="detalle">
		<li><span class="boton">Nou:</span> permet incorporar un nou par&agrave;metre i el valor a assignar-li</li>
		<li><span class="boton">Editar:</span> permet editar un par&agrave;metre existent pr&egrave;viament seleccionat.</li>
		<li><span class="boton">Eliminar:</span> permet eliminar un par&agrave;metre existent pr&egrave;viament seleccionat.</li>
		</ul>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Previsualitzar versi&oacute;</span>: llan&ccedil;a la previsualitzaci&oacute; del tr&agrave;mit en una nova pestanya del navegador. &Eacute;s important verificar que el navegador utilitzat no tingui bloquejat el mostrat de finestres emergents.</li>
		<li><span class="boton">Cancel&middot;lar</span>: tanca la finestra sense llan&ccedil;ar la previsualitzaci&oacute;.</li>
	</ul>
</p>
</body>
</html>