<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">MANTENIMENT CONTROL D'ACC&Eacute;S</h1>
<p>
	En la pantalla de<i>' Manteniment de control d'acc&eacute;s</i>' pot mantenir les configuracions de la versi&oacute; d'un tr&agrave;mit relatives a l'acc&eacute;s de la mateixa per part dels ciutadans des de l'assistent de tramitaci&oacute;<br>
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Actiu:</span> casella de verificaci&oacute; que indica si la versi&oacute; est&agrave; activa. En cas de no estar activa no es podr&agrave; iniciar una sol&middot;licitud des de l'assistent de tramitaci&oacute;.</li>
		<li><span class="nombreCampo">Missatge d'av&iacute;:</span> permet configurar una av&iacute;s visible per part del ciutad&agrave;, des de l'assistent de tramitaci&oacute; en iniciar una sol&middot;licitud. Les opcions relatives a aquests avisos s&oacute;n:</li>
		<ul class="detalle">
		<li><span class="boton">Missatge:</span> permet introduir el text multiidioma vinculat al missatge a mostrar al ciutad&agrave;.</li>
		<li><span class="boton">Data inici:</span> permet establir una data d'inici a partir de la qual es mostrar&agrave; el missatge. Si no es consigna valor el missatge aplicar&agrave; en qualsevol moment.</li>
		<li><span class="boton">Data final:</span> permet establir una data de final fins la qual es mostrar&agrave; el missatge. Si no es consigna valor el missatge aplicar&agrave; en qualsevol moment.</li>
		<li><span class="boton">Deshabilitar acc&eacute;s:</span> permet establir si, a m&eacute;s del mostrar un missatge, es deshabilita l'acc&eacute;s a la versi&oacute; del tr&agrave;mit des de l'assistent de tramitaci&oacute;</li>
		</ul>
		<li><span class="nombreCampo">Habilitar debug:</span> permet habilitar la impressi&oacute; en el log de traces de debug incloses en la versi&oacute; del tr&agrave;mit, com s&oacute;n les que puguin ser generades des dels scripts</li>
		<li><span class="nombreCampo">Limitar tramitaci&oacute;:</span> permet establir una limitaci&oacute; respecte a l'inici de sol&middot;licituds des de l'assistent. Aquesta opci&oacute; pot ser &uacute;til per a tr&agrave;mits que puguin tenir una alta concurr&egrave;ncia. Les opcions relatives a aquesta limitaci&oacute; s&oacute;n:</li>
		<ul class="detalle">
		<li><span class="boton">Nre. de tramitacions:</span> nombre m&agrave;xim de sol&middot;licituds que es permetr&agrave; iniciar en un interval de temps concret.</li>
		<li><span class="boton">Interval (minuts):</span> interval de temps, en minuts, al qual aplicar&agrave; el nombre m&agrave;xim de tramitacions establert.</li>
		</ul>

	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Desar</span>: tanca la pantalla desant els canvis.</li>
		<li><span class="boton">Cancel&middot;lar</span>: tanca la pantalla sense desar els canvis.</li>
	</ul>
</p>
</body>
</html>