<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">QUADRE DE COMANDAMENT</h1>
<p>

A la pantalla de '<i>Quadre de comandament</i>' es presenta l&#39;estat del proc&eacute;s de tramitaci&oacute; transcorregut en un per&iacute;ode de temps determinat, des dels esdeveniments i tr&agrave;mits que s&#39;han iniciat i finalitzat, fins a l&#39;activitat produ&iuml;da als tr&agrave;mits que hagin generat algun error, passant per un historial de les alertes executades.
</p>

<p>Es presenten les seg&uuml;ents zones i panells:</p>

<h2 class="stgH2">Avaluaci&oacute; en:</h2>
<p>En aquesta zona es pot indicar el per&iacute;ode de monitoritzaci&oacute;, amb les opcions seg&uuml;ents:</p>
<p>
	<ul>
		<li><span class="nombreCampo">Temps real:</span> &Eacute;s l&#39;opci&oacute; per defecte i on es pot indicar, dins del dia actual, l&#39;hora des d&#39;on s&#39;avalua l&#39;estat de la tramitaci&oacute; i els minuts de refresc, que permet determinar cada quants minuts es refrescar&agrave; la informaci&oacute;. A m&eacute;s, &eacute;s possible refrescar manualment, prement el bot&oacute; &rdquo;Refrescar&rdquo;.</li>
		<li><span class="nombreCampo">Interval de temps:</span> &Eacute;s on es pot indicar una data Des (obligat&ograve;ria) i una data Fins, de manera que en pr&eacute;mer &ldquo;Cerca&rdquo; s&#39;obt&eacute; tota la informaci&oacute; del proc&eacute;s de tramitaci&oacute; transcorregut en aquest per&iacute;ode. A causa del proc&eacute;s de purgat d&#39;esdeveniments que es realitza en funci&oacute; de les propietats globals relacionades, la data Des es limita la data resultant de restar a la data actual, els dies definits a la propietat global &quot;sistramit.purga.purgados&quot; (actualment 90 dies), ja que, els dies anteriors ja no existeixen els esdeveniments a la BBDD i les estad&iacute;stiques no serien reals.</li>
	</ul>
</p>

<h2 class="stgH2">Accions:</h2>
<p>En aquest panell es presenten totes les accions ocorregudes en el dia actual o per&iacute;ode temporal indicat, organitzades per tipus d'acci&oacute;.</p>
<p>
	<ul>
		<li><span class="nombreCampo">Emplenar formulari:</span> Es mostra el nombre de vegades que s&#39;ha iniciat i finalitzat l&#39;acci&oacute; d&#39;emplenar formularis, i el percentatge d&#39;accions d&#39;aquest tipus no finalitzades (amb o sense errors), es a dir, la proporci&oacute; de no finalitzades respecte al total de vegades que s&#39;ha iniciat l&#39;acci&oacute; d&#39;omplir formulari.</li>
		<li><span class="nombreCampo">Signar:</span> Es mostra el nombre de vegades que s&#39;ha iniciat i finalitzat l&#39;acci&oacute; de signar, i el percentatge d&#39;accions d&#39;aquest tipus no finalitzades (amb o sense errors), es a dir, la proporci&oacute; de no finalitzades respecte al total de vegades que s&#39;ha iniciat l&#39;acci&oacute; de signar.</li>
		<li><span class="nombreCampo">Pagar:</span> Es mostra el nombre de vegades que s&#39;ha iniciat i finalitzat l&#39;acci&oacute; de pagar, i el percentatge d&#39;accions d&#39;aquest tipus no finalitzades (amb o sense errors), es a dir, la proporci&oacute; de no finalitzades respecte al total de vegades que s&#39;ha iniciat l&#39;acci&oacute; de pagar.</li>
		<li><span class="nombreCampo">Registrar:</span> Es mostra el nombre de vegades que s&#39;ha iniciat i finalitzat l&#39;acci&oacute; de registrar, i el percentatge d&#39;accions d&#39;aquest tipus no finalitzades (amb o sense errors), es a dir, la proporci&oacute; de no finalitzades respecte al total de vegades que s&#39;ha iniciat l&#39;acci&oacute; de registrar.</li>
	</ul>
</p>
<p>A la darrera columna d&#39;aquest panell de mostren per colors, si cal o no atenci&oacute;, en funci&oacute; d&#39;un llindar (percentatge d&#39;accions no finalitzades) predeterminat:</p>
<p>
	<ul>
		<li><span class="nombreCampo">Normal:</span> No s&#39;han aconseguit el 50% d&#39;accions no finalitzades a partir de les iniciades.</li>

		<li><span class="nombreCampo">Atenci&oacute;:</span> El percentatge &eacute;s entre el 50% i el 85%.</li>

		<li><span class="nombreCampo">Revisar:</span> S&#39;ha aconseguit o superat el 85% d&#39;accions no finalitzades a partir de les iniciades.</li>

	</ul>
</p>

<h2 class="stgH2">Tr&agrave;mits:</h2>
<p>Aquest panell mostra la mateixa informació que el panell "Accions", pero a nivell de tràmit.</p>
<p>
	<ul>
		<li><span class="nombreCampo">Tr&agrave;mits:</span> Es mostra la quantitat dels iniciats, els finalitzats, el percentatge de no finalitzats (amb o sense errors) respecte dels iniciats i, per colors, l&#39;estat d&#39;atenci&oacute; requerida segons el llindar predeterminat, &eacute;s a dir: Normal (percentatge de tr&agrave;mits no finalitzats inferior o igual al 50%), Atenci&oacute; (percentatge entre el 50% i el 85%) i Revisar (percentatge de tr&agrave;mits no finalitzats superior o igual al 85%).</li>
	</ul>
</p>

<h2 class="stgH2">Número total d'errors:</h2>
<p>En aquest panell es mostra el total de errors, considerant els errors de tramitació (associats a una sessió concreta) i els de plataforma (que no tenen una sessió de tramitació associada).</p>
<h2 class="stgH2">Errors de tramitació:</h2>
<p>Aquest panell mostra (depenent del valor indicat al selector de la dreta):</p>
<p>
	<ul>
		<li><p><span class="nombreCampo">Errors per tr&agrave;mit:</span> Si se selecciona aquesta classificació, el panell mostra els tr&agrave;mits en què existeixen sessions que contenen errors i els errors que s&#39;han produ&iuml;t. Es distingeixen dos nivells d&#39;informaci&oacute;, sobre els quals es poden ordenar les dades de qualsevol columna:</p>
		<p>- Un primer nivell '<i>Tr&agrave;mit</i>': Mostra informaci&oacute; de cada tr&agrave;mit que t&eacute; errors en alguna de les sessions en el període indicat. S&#39;ofereix la seg&uuml;ent informaci&oacute;, que en ser filtrada per tràmit i versió, proporciona una visió global sobre la situació del mateix:</p>
		<ul>
			<li><span class="nombreCampo">Tr&agrave;mit:</span> L&#39;id compost de cada un dels tr&agrave;mits que contenen errors en alguna de les sessions. &Eacute;s possible cercar en aquest camp.</li>
			<li><span class="nombreCampo">Versi&oacute;:</span> La versi&oacute; del tr&agrave;mit.</li>
			<li><span class="nombreCampo">Sessions Ok:</span> El nombre de sessions que s&#39;han iniciat (TR_INI - Inici del tr&agrave;mit) i finalitzat (TR_FIN - Final de tr&agrave;mit). En aquestes sessions apareixen les que, per a aquest tràmit i versió, no hi ha errors o sí, errors que no n'han impedit la finalització.</li>
			<li><span class="nombreCampo">Sessions no finalitzades:</span> El nombre de sessions que s&#39;han iniciat per&ograve; no han finalitzat (amb i sense errors).</li>
			<li><span class="nombreCampo">Percentatge de sessions no finalitzades:</span> Proporci&oacute; de les sessions no finalitzades (amb i sense errors), respecte de les sessions iniciades en aquest tr&agrave;mit i versi&oacute;.</li>
			<li><span class="nombreCampo">Suma d&#39;errors:</span> Número total d&#39;errors succe&iuml;ts a les sessions d&#39;aquest tr&agrave;mit i versi&oacute; que contenen errors. Aquests errors son la suma dels que es detallen al segon nivell (&ldquo;Error&rdquo;), en pr&eacute;mer sobre un registre d'aquest nivell &ldquo;Tr&agrave;mit&rdquo;.</li>
		</ul>
		<p>- Un segon nivell '<i>Error</i>': Mostra la estadística de cada tipus d&#39;error ocorregut a les diferents sessions de tramitaci&oacute; per al tr&agrave;mit i versi&oacute; del nivell superior corresponent i, en fer doble clic sobre un registre, el detall de cada error d&#39;aquest tipus. S&#39;ofereix la informaci&oacute; seg&uuml;ent:</p>
		<ul>
			<li><span class="nombreCampo">Error:</span> L&#39;error o excepci&oacute; que ha succe&iuml;t a la sessi&oacute; de tramitaci&oacute;.</li>
			<li><span class="nombreCampo">Número d&#39;errors:</span> El número d&#39;errors d&#39;aquest tipus succe&iuml;ts al tr&agrave;mit y versi&oacute; corresponent.</li>
			<li><span class="nombreCampo">Percentatge d&#39;error:</span> La proporci&oacute; d&#39;errors d&#39;aquest respecte als errors totals a aquest tr&agrave;mit y versi&oacute;.</li>
		</ul>
	</ul>
	<ul>
		<li><p><span class="nombreCampo">Tr&agrave;mits per error:</span> Si se selecciona aquesta classificació, el panell mostra mostra els errors que s'han produït i els tràmits en les sessions dels quals s'han produït. Es distingeixen dos nivells d&#39;informaci&oacute;, sobre els quals es poden ordenar les dades de qualsevol columna:</p>
		<p>- Un primer nivell '<i>Error</i>': Mostra informaci&oacute; de cada tipus d&#39;error que ha succeït en el període indicat. S&#39;ofereix la seg&uuml;ent informaci&oacute;, que en ser filtrada per tipus d&#39;error, proporciona una visió mes concreta sobre la situació del mateix:</p>
		<ul>
			<li><span class="nombreCampo">Error:</span> Cada un dels errors o excepcions que han succe&iuml;t a les sessions de tramitaci&oacute;.</li>
			<li><span class="nombreCampo">Suma d&#39;errors:</span> La suma dels errors d&#39;aquest tipus succe&iuml;ts a les sessions de tramitaci&oacute;, que s&oacute;n els que es detallen al segon nivell (&ldquo;Tr&agrave;mit&rdquo;), en pr&eacute;mer sobre un registre d'aquest nivell (&ldquo;Error&rdquo;).</li>
			<li><span class="nombreCampo">Percentatge d&#39;error:</span> La proporci&oacute; d&#39;errors d&#39;aquest tipus respecte als errors totals succe&iuml;ts a les sessions de tramitaci&oacute;.</li>
		</ul>
		<p>- Un segon nivell '<i>Tr&agrave;mit</i>': Mostra la estadística de cada Tr&agrave;mit en què ha succeït aquest tipus d'error a les diferents sessions de tramitació per al tipus d'error del nivell superior corresponent i, en fer doble clic sobre un registre, el detall de cada error d'aquest tipus. S&#39;ofereix la informaci&oacute; seg&uuml;ent:</p>
		<ul>
			<li><span class="nombreCampo">Tr&agrave;mit:</span> L&#39;id compost del tr&agrave;mit en què hi ha alguna sessió en què s'ha produït el tipus d'error. &Eacute;s possible cercar en aquest camp.</li>
			<li><span class="nombreCampo">Versi&oacute;:</span> La versi&oacute; del tr&agrave;mit.</li>
			<li><span class="nombreCampo">Sessions Ok:</span> El nombre de sessions que s&#39;han iniciat (TR_INI - Inici del tr&agrave;mit) i finalitzat (TR_FIN - Final de tr&agrave;mit), en què hi hagi errors d'aquest tipus, que no n'hagin impedit la finalització. En aquest cas, com que es filtra per tipus d'error, les sessions no s'expliquen sense errors d'aquest tràmit i versió.</li>
			<li><span class="nombreCampo">Sessions no finalitzades:</span> El nombre de sessions que s&#39;han iniciat per&ograve; no han finalitzat (amb errors d'aquest tipus).</li>
			<li><span class="nombreCampo">Percentatge de sessions no finalitzades:</span> Proporci&oacute; de les sessions no finalitzades (amb errors d'aquest tipus), respecte de les sessions iniciades en aquest tr&agrave;mit i versi&oacute;.</li>
			<li><span class="nombreCampo">Número d&#39;errors:</span> Número total d&#39;errors d'aquest tipus succe&iuml;ts a les sessions d&#39;aquest tr&agrave;mit i versi&oacute;.</li>
		</ul>
	</ul>
</p>

<h2 class="stgH2">Errors de plataforma:</h2>
<p>En aquest panell s&#39;ofereix informaci&oacute; de quants errors de plataforma (i el detall) han succe&iuml;t al llarg de l&#39;&uacute;s de l&#39;assistent de tramitaci&oacute; en el per&iacute;ode d&#39;avaluaci&oacute;. Aquests errors no s&oacute;n propis d&#8223;un tr&agrave;mit concret, sin&oacute; que s&oacute;n m&eacute;s gen&egrave;rics, a nivell de SISTRAMIT.</p>

<h2 class="stgH2">Tràmits inacabats sense errors:</h2>
<p>Aquest panell mostra els tr&agrave;mits que només tenen sessions inacabades i sense errors, per tant, no apareixeran aquells tràmits que tenen alguna sessió amb errors, inacabada o finalitzada. Es possible ordenar per totes les columnes:</p>
<p>
	<ul>
		<li><span class="nombreCampo">Tr&agrave;mit:</span> L&#39;id compost del tr&agrave;mit que cont&eacute; sessions no finalitzades i sense errors. &Eacute;s possible cercar en aquest camp.</li>
		<li><span class="nombreCampo">Versi&oacute;:</span> La versi&oacute; del tr&agrave;mit.</li>
		<li><span class="nombreCampo">Sessions no finalitzades:</span> El nombre de sessions que s&#39;han iniciat per&ograve; no han finalitzat (sense errors).</li>
	</ul>
</p>

<h2 class="stgH2">Historial d&#39;alertes:</h2>
<p>Aquest panell, que poden veure els administradors d&#39;entitat, mostra en ordre cronol&ograve;gic descendent, les alertes executades i la data d&#39;execuci&oacute; dins del per&iacute;ode del dia en curs. Les alertes mostrades s&oacute;n les que s&#39;han executat i rem&eacute;s correu, en haver-se avaluat com a cert la condici&oacute; o condicions configurades a la pantalla d&#39;&ldquo;Alertes&rdquo;.</p>

</p>
</body>
</html>