<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">DEFINICI&Oacute;N DE ALERTAS</h1>
<p>

En esta pantalla, que aparece al crear o editar una alerta, se pueden configurar los diferentes par&aacute;metros de una alerta. 
</p>

<h2 class="stgH2">CAMPOS:</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Resumen diario:</span> Si no existe ya una alerta de este tipo, aparece este check que, al marcarlo, define un tipo de alerta especial, que permite enviar un correo a los remitentes indicados a las 00:00 del d&iacute;a siguiente, con un resumen de todo lo que se ha producido en el asistente de tramitaci&oacute;n y mostrado en el cuadro de mandos del d&iacute;a reci&eacute;n finalizado. Si ya existe una alerta de este tipo, este check no aparecer&aacute; y s&oacute;lo se podr&aacute; definir una alerta convencional.</li>
		<li><span class="nombreCampo">Nombre:</span> En este campo, si se ha indicado que la alerta es de tipo &ldquo;Resumen diario&rdquo;, se definir&aacute; el valor &ldquo;RESUMEN_DIARIO&rdquo; de forma autom&aacute;tica y no podr&aacute; ser modificado. Si la alerta es convencional, en este campo se puede definir un nombre significativo.</li>
		<li><span class="nombreCampo">Tipo:</span> En este selector se puede definir el tipo de la alerta, que determinará el ámbito sobre el que actuará la alerta. Puede seleccionarse que la alerta sea de tipo 'Entidad' (que aplicará a todos los trámites de la entidad), de tipo 'Área' (para aplicar la alerta a los trámites de un área), de tipo 'Trámite' (para un trámite con todas sus versiones) o de tipo 'Versión' (para aplicarla tan sólo a una versión concreta de un trámite específico).</li>
		<li><span class="nombreCampo">Ámbito:</span> En función del tipo seleccionado, en esta sección aparecerán los selectores necesarios para definir la entidad, el área, el trámite y la versión concretas.</li>
		<li><span class="nombreCampo">Lista de emails:</span> Permite indicar los correos electr&oacute;nicos de los remitentes a los que se enviar&aacute; el aviso, separados por ;.</li>
		<li><span class="nombreCampo">Intervalo de evaluaci&oacute;n:</span> Si la alerta es convencional se podr&aacute; indicar, en horas y en minutos (de 5 en 5), cada cu&aacute;nto tiempo se evaluar&aacute; la alerta.</li>
		<li><span class="nombreCampo">Periodo de evaluaci&oacute;n:</span> Si la alerta es convencional se podr&aacute; definir desde y hasta qu&eacute; hora y minuto se eval&uacute;a la alerta.</li>
		<li><span class="nombreCampo">Expresi&oacute;n a evaluar:</span> Si la alerta es convencional indicará la expresión que se evaluará, en función de los eventos definidos en la parte inferior.</li>
		<li><span class="nombreCampo">Expresi&oacute;n de evaluaci&oacute;n:</span> Si la alerta es convencional se podr&aacute; indicar el grupo (empezando siempre por 1 y con el que se podrán definir paréntesis para agrupar diferentes eventos), el operador lógico AND u OR (para unir dos eventos consecutivos y aplicar tal operador lógico sobre ellos), el operador lógico NOT (que permite indicar que el evento tendrá el efecto contrario), el evento a evaluar, un operador matem&aacute;tico y el n&uacute;mero de concurrencias que deben darse para lanzar la alerta. Por ejemplo, se puede indicar la expresi&oacute;n: (Error >= 50) OR (Inicio de trámite > 200 AND Registro trámite > 50), de forma que cuando en la plataforma se hayan alcanzado m&aacute;s de 50 errores o se hayan iniciado más de 200 trámites y se hayan registrado más de 50, para una versión o un trámite o todos los trámites de un área o todos los de la entidad (según el tipo y ámbito definidos), se enviar&aacute; un correo para indicar esa circunstancia. El botón 'Añadir' puede adquirir diferentes etiquetas, para indica rla función que se llevará a cabo al pulsarlo, según se actúe sobre la lista de eventos, como se explicará a continuación (Añadir/Insertar/Editar).</li>
		<li><span class="nombreCampo">Eventos:</span> En este panel se mostrar&aacute;n las distintas expresiones a&ntilde;adidas y se aplicar&aacute; le operador l&oacute;gico indicado a la hora de definirlos en la sección anterior, de forma que si es cierta la expresión a evaluar, se enviar&aacute; el correo y a&ntilde;adir&aacute; al historial de alertas del cuadro de mandos. En cada expresión aparecen los botones de 'Editar' (que permitirá modificar el evento correspondiente al botón pulsado) y 'Eliminar' (qué permite borrar un evento, de forma que se reorganizarán los grupos y paréntesis de los eventos posteriores para adaptarse a esa acción). También es posible insertar un evento sobre el evento seleccionado (tras pulsar sobre cualquier zona del evento, distinta a sus botones) y añadir eventos al final de los actuales (en caso de no haber ningún evento en la lista o de no haber seleccionado ninguno).</li>
	</ul>
</p>

<h2 class="stgH2">OPERATIVA:</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Guardar:</span> Permite guardar la alerta configurada.</li>
		<li><span class="nombreCampo">Cancelar:</span> Permite salir de la pantalla sin guardar los cambios.</li>
	</ul>
</p>

</body>
</html>