<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">MANTENIMENTO DE TASA</h1>
<p>
	En la pantalla de '<i>Mantenimiento de tasa</i>' puede gestionar las configuraciones de la tasa.<br>
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Identificador:</span> c&oacute;digo un&iacute;voco que identifica la tasa en la aplicaci&oacute;n. Cualquier referencia a la tasa en los scripts de la versi&oacute;n se realizar&aacute; utilizando este c&oacute;digo.</li>
		<li><span class="nombreCampo">Descripci&oacute;n:</span> texto multiidioma de presentaci&oacute;n de la tasa en el asistente de tramitaci&oacute;n. Esta ser&aacute; la denominaci&oacute;n de la tasa que visualizar&aacute; el tramitador en el asistente de tramitaci&oacute;n.</li>
		<li><span class="boton">Obligatoriedad:</span> permite configurar la obligatoriedad de paga la tasa en el asistente de tramitaci&oacute;n. Los valores posibles son:</li>
		<ul class="detalle">
		<li><span class="boton">Obligatorio:</span> si se marca esta opci&oacute;n ser&aacute; obligatorio el pago de la tasa en el asistente. En caso contrario no se podr&aacute; con la cumplimentaci&oacute;n del tr&aacute;mite.</li>
		<li><span class="boton">Opcional:</span> si se marca esta opci&oacute;n el pago de la tasa ser&aacute; opcional.</li>
		<li><span class="boton">Depende:</span> si se marca esta opci&oacute;n la obligatoriedad de realizar el pago de la tasa depender&aacute; del script 'Establecer dependencia'.</li>
		<li><span class="boton">Establecer dependencia:</span> script que permite establecer la obligatoriedad del pago de la tasa seg&uacute;n otros datos del tr&aacute;mite (dominios, datos de un formulario previo, datos de sesi&oacute;, etc.). &uacute;nicamente se tendr&aacute; en cuenta el valor de este script si se ha fijado previamente la obligatoriedad 'Depende'.</li>
		</ul>
		<li><span class="nombreCampo">Script de pago:</span> sscript que permite configurar los detalles de la tasa (plataforma de pago, c&oacute;digo de tasa, importe, concepto, pagador, etc.). Actualmente,
			se pueden configurar dos tipos de pago dependiendo de la pasarela de pagos que se configure. A continuaci&oacute;n se detalla cada uno de estos pagos:</li>
		<ul class="detalle">
			<li><span class="boton">Pagos mediante la pasarela de pagos de la ATIB:</span> Los par&aacute;metros que se han de indicar para configurar correctamente el pago per la ATIB son los siguientes: </li>
					<ul>
						<li><span><b>DATOS_PAGO.setPasarela():</b></span> Passarela de pago, en este caso ‘ATIB’.</li>
						<li><span><b>DATOS_PAGO.setOrganismo():</b></span> Identificador del organismo. En el caso de utilizar la passarela de la ATIB, este campo es opcional.</li>
						<li><span><b>DATOS_PAGO.setDetallePago():</b></span> Se ha de indicar el modelo de pago, el concepto, la tasa y el importe.</li>
						<li><span><b>DATOS_PAGO.setMetodosPago():</b></span> Se podran establecer los diferentes m&eacute;todos de pago que se permitirán. En la ayuda de la funci&oacute;n se detallan los m&eacute;todos configurables.  </li>
					</ul>
			<li><span class="boton">Pagos mediante la pasarela de pagos TPV:</span> Los par&aacute;metros que se han de indicar para configurar correctamente el pago per la ATIB son los siguientes:</li>
					<ul>
						<li><span><b>DATOS_PAGO.setPasarela():</b></span> PPassarela de pago, en este caso ‘TPV’.</li>
						<li><span><b>DATOS_PAGO.setOrganismo():</b></span> Identificador del organismo. En este caso, el organismo es obligatorio. En las properties de la aplicac&oacute;n de PaymentIB se pueden dar de alta los organismos que podran utilizar este tipo de pago.
						Para configurarlos, será necesario indicar a los responsables de SISTRA2 y PAYMENTIB las siguientes propiedades: </li>
							<ul>
								<li><span><b>Merchant Name</b></span> Nombre del organismo que utiliza TPV</li>
								<li><span><b>Merchant Code</b></span> Código FUC asignado al organismo.</li>
								<li><span><b>Merchant Terminal</b></span> N&oacute;mero de terminal que le assignar&agrave; el banco.</li>
								<li><span><b>Merchant Password</b></span> Contraseña del organismo.</li>
							</ul>
							<p> Actualmente, están configurados los siguientes organismos: </p>
							<ul>
								<li><span><b>'ieb': </b></span>Instituto de estudios bale&aacute;ricos.</li>
								<li><span><b>'ibavi': </b></span>Instituto Balear del Habitage.</li>
								<li><span><b>'ports': </b></span>Puertos de las Islas Baleares.</li>
								<li><span><b>'ibjove': </b></span>IB Joven.</li>
							</ul>
							<br>
						<li><span><b>DATOS_PAGO.setDetallePago():</b></span> Se ha de indicar el modelo de pago, el concepto, la tasa y el importe.</li>
						<li><span><b>DATOS_PAGO.setMetodosPago():</b></span> Se podran establecer los diferentes m&eacute;todos de pago que se permitirán. En la ayuda de la funci&oacute;n se detallan los m&eacute;todos configurables. </li>
					</ul>
		<li><span class="boton">Simular pago:</span> <i>check</i> que, en caso de estar activo, activa la simulaci&oacute;n del pago. Esta opci&oacute;n tiene sentido para entornos de desarrollo.</li>
		</ul>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Guardar</span>: cierra la pantalla guardando los cambios.</li>
		<li><span class="boton">Cancelar</span>: cierra la pantalla sin guardar los cambios.</li>
	</ul>
</p>
</body>
</html>