<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">PASO ANEXAR DOCUMENTO</h1>
<p>
	En la pantalla de '<i>Paso Anexar Documento</i>' se gestionan los documentos anexos de la versi&oacute;n del tr&aacute;mite. Se permite el alta, baja y edici&oacute;n de documentos anexos, as&iacute; como la ordenaci&oacute;n de los mismos para su presentaci&oacute;n al ciudadano en el asistente de tramitaci&oacute;n.<br>
	Esta pantalla permite establecer los documentos anexos a trav&eacute;s de una lista fija, o de manera din&aacute;mica utilizando el script 'Lista din&aacute;mica anexos'.
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Lista fija</span>: tabla que muestra la lista fija de documentos anexos definidos. La operaciones permitidas para este listado son:</li>
		<ul class="detalle">
		<li><span class="boton">Nuevo</span>: pulsando en el bot&oacute;n se abrir&aacute; la <a href="../../ayuda/es/definicionVersionAnexarDocumentosDialog.html">ficha</a> que crear un documento anexo.</li>
		<li><span class="boton">Editar</span>: pulsando este bot&oacute;n se abrir&aacute; la <a href="../../ayuda/es/definicionVersionAnexarDocumentosDialog.html">ficha</a> para la edici&oacute;n de las configuraciones del anexo seleccionado.</li>
		<li><span class="boton">Eliminar</span>: pulsando este bot&oacute;n se eliminar&aacute; el anexo que se haya seleccionado previamente en el listado. Previo a la eliminaci&oacute;n se solicitar&aacute; confirmaci&oacute;n al usuario.</li>
		<li><span class="boton">Subir</span>: este bot&oacute;n permite subir la posici&oacute;n del anexo seleccionado en el listado de anexos presentados.</li>
		<li><span class="boton">Bajar</span>: este bot&oacute;n permite subir la posici&oacute;n del anexo seleccionado en el listado de anexos presentados.</li>
		</ul>
		<li><span class="boton">Lista din&aacute;nica anexos</span>: script que permite la definici&oacute;n din&aacute;mica de documentos anexos.</li>
	</ul>
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Identificador:</span> c&oacute;digo un&iacute;voco que identifica el anexo en la aplicaci&oacute;n. Cualquier referencia al anexo en los scripts de la versi&oacute;n se realizar&aacute; utilizando este c&oacute;digo.</li>
		<li><span class="nombreCampo">Descripci&oacute;n:</span> texto multiidioma de presentaci&oacute;n del anexo en el asistente de tramitaci&oacute;n. Esta ser&aacute; la denominaci&oacute;n del anexo para el tramitador.</li>
		<li><span class="nombreCampo">Obligatoriedad:</span> obligatoriedad del documento anexo. El documento puede ser obligatorio, opcional o dependiente de script.</li>
	</ul>
</p>
</body>
</html>