<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">Edición parámetros dominio</h1>
<p>
	En la pantalla de '<i>Par&#225;metros de dominio</i>' se permite el alta, la edici&oacute;n o la baja de un par&#225;metro de dominio. Al añadir un par&#225;metro, nos aparecer&#225;n los siguientes campos:<br>

</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Par&#225;metro:</span>  Par&#225;metro del dominio. Aparecer&#225; un desplegable que indicar&#225; cuales son los par&#225;metros que requiere el dominio</li>
		<li><span class="nombreCampo">Valor:</span> Valor que tindr&#225; el par&#225;metro seleccionado.</li>
		<li><span class="nombreCampo">Tipo:</span> El tipo es la forma en la que va a coger el valor el par&#225;metro seleccionado. Puede ser de uno de los 4 tipos que se muetran a continuaci&#243;n:</li>
		<p>
			<ul>
				<li><span class="nombreCampo">Constante:</span> Si el tipo de par&#225;metro seleccionado es de tipo ‘Constante’, el par&#225;metro tendr&#225; como valor lo que haya en el campo ‘Valor’. Es decir, el valor del par&#225;metro que se li enviar&#225; al dominio ser&#225; lo que se infique en el campo ‘Valor’.</li>
				<li><span class="nombreCampo">Campo:</span> Si el tipo de par&#225;metro seleccionado es de tipo ‘Campo’, el par&#225;metro tendr&#225; como valor el valor del campo de texto que tenga el identificador igual al 'Valor' de este par&#225;metro.</li>
				<li><span class="nombreCampo">Par&#225;metro:</span> Si el tipo de par&#225;metro seleccionado es de tipo ‘Par&#225;metro’, el par&#225;metro tendr&#225; el valor del par&#225;metro que tendr&#225; que estar previamente definido en el script de ‘Par&#225;metres de apertura del formulario’ y que se indicar&#225; en el campo ‘Valor’</li>
				<li><span class="nombreCampo">Sesi&#243;n:</span> Si el tipo de par&#225;metro seleccionado es de tipo ‘Sessi&#243;n’, en el camp ‘Valor’ aparecer&#225; una lista desplegable con las opciones de datos de la sesi&#243;n que se pueden escoger como valor. En este casos, el valor se selecciona de una lista desplegable y no se introduce por el desarrollador de tr&#225;mites.</li>
			</ul>
		</p>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Guardar</span>: cierra la pantalla guardando los cambios.</li>
		<li><span class="boton">Cancelar</span>: cierra la pantalla sin guardar los cambios.</li>
	</ul>
</p>
</body>
</html>