<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">PASO RELLENAR FORMULARIO</h1>
<p>
	En la pantalla de '<i>Paso Rellenar Formulario</i>' se gestionan los formularios de la versi&oacute;n del tr&aacute;mite. Se permite el alta, baja y edici&oacute;n de documentos de tipo formulario, as&iacute; como la ordenaci&oacute;n de los mismos para su presentaci&oacute;n al ciudadano en el asistente de tramitaci&oacute;n.<br>
	El listado de formularios utilizados por la versi&oacute;n se presenta paginado, pudi&eacute;ndose seleccionar el n&uacute;mero de elementos por p&aacute;gina a mostrar.
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Nuevo</span>: pulsando en el bot&oacute;n se abrir&aacute; la <a href="../../ayuda/es/definicionVersionDominiosDialog.html">ficha</a> que crear un documento de tipo formulario.</li>
		<li><span class="boton">Editar</span>: pulsando este bot&oacute;n se abrir&aacute; la <a href="../../ayuda/es/definicionVersionDominiosDialog.html">ficha</a> para la edici&oacute;n de las configuraciones del formulario seleccionado.</li>
		<li> <span class="boton">Eliminar</span>: pulsando este bot&oacute;n se eliminar&aacute; el formulario que se haya seleccionado previamente en el listado. Previo a la eliminaci&oacute;n se solicitar&aacute; confirmaci&oacute;n al usuario.</li>
		<li> <span class="boton">Subir</span>: este bot&oacute;n permite subir la posici&oacute;n del formulario seleccionado en el listado de formularios presentados.</li>
		<li> <span class="boton">Bajar</span>: este bot&oacute;n permite subir la posici&oacute;n del formulario seleccionado en el listado de formularios presentados.</li>
	</ul>
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Identificador:</span> c&oacute;digo un&iacute;voco que identifica al formulario en la aplicaci&oacute;n. Cualquier referencia al formulario en los scripts de la versi&oacute;n se realizar&aacute; utilizando este c&oacute;digo.</li>
		<li><span class="nombreCampo">Descripci&oacute;n:</span> texto multiidioma de presentaci&oacute;n del formulario en el asistente de tramitaci&oacute;n. Esta ser&aacute; la denominaci&oacute;n del formulario para el tramitador.</li>
		<li><span class="nombreCampo">Tipo:</span> tipo de formulario, que puede ser interno o externo. Por defecto los formularios son internos. Los formulario externos se refieren a aquellos implementados con gestores de formularios externos.</li>
	</ul>
</p>
</body>
</html>