<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">MANTENIMENTO DE TASA</h1>
<p>
	En la pantalla de '<i>Mantenimento de tasa</i>' puede gestionar las configuraciones de la tasa.<br>
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Identificador:</span> c&oacute;digo un&iacute;voco que identifica la tasa en la aplicaci&oacute;n. Cualquier referencia a la tasa en los scripts de la versi&oacute;n se realizar&aacute; utilizando este c&oacute;digo.</li>
		<li><span class="nombreCampo">Descripci&oacute;n:</span> texto multiidioma de presentaci&oacute;n de la tasa en el asistente de tramitaci&oacute;n. Esta ser&aacute; la denominaci&oacute;n de la tasa que visualizar&aacute; el tramitador en el asistente de tramitaci&oacute;n.</li>
		<li><span class="boton">Obligatoriedad:</span> permite configurar la obligatoriedad de paga la tasa en el asistente de tramitaci&oacute;n. Los valores posibles son:</li>
		<ul class="detalle">
		<li><span class="boton">Obligatorio:</span> si se marca esta opci&oacute;n ser&aacute; obligatorio el pago de la tasa en el asistente. En caso contrario no se podr&aacute; con la cumplimentaci&oacute;n del tr&aacute;mite.</li>
		<li><span class="boton">Opcional:</span> si se marca esta opci&oacute;n el pago de la tasa ser&aacute; opcional.</li>
		<li><span class="boton">Depende:</span> si se marca esta opci&oacute;n la obligatoriedad de realizar el pago de la tasa depender&aacute; del script 'Establecer dependencia'.</li>
		<li><span class="boton">Establecer dependencia:</span> script que permite establecer la obligatoriedad del pago de la tasa seg&uacute;n otros datos del tr&aacute;mite (dominios, datos de un formulario previo, datos de sesi&oacute;, etc.). &uacute;nicamente se tendr&aacute; en cuenta el valor de este script si se ha fijado previamente la obligatoriedad 'Depende'.</li>
		</ul>
		<li><span class="boton">Script de pago:</span> script que permite configurar los detalles de la tasa (plataforma de pago, c&oacute;digo de tasa, importe, concepto, pagador, etc.).</li>
		<li><span class="boton">Tipo de pago:</span> selector que pemite fijar el tipo de pago disponible para la tasa.</li>
		<li><span class="boton">Simular pago:</span> <i>check</i> que, en caso de estar activo, activa la simulaci&oacute;n del pago. Esta opci&oacute;n tiene sentido para entornos de desarrollo.</li>
		</ul>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Guardar</span>: cierra la pantalla guardando los cambios.</li>
		<li><span class="boton">Cancelar</span>: cierra la pantalla sin guardar los cambios.</li>
	</ul>
</p>
</body>
</html>