<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">GESTI&Oacute;N DE ENTIDADES</h1>
<p>
	En la pantalla de '<i>Gesti&oacute;n de entidades</i>' puede gestionar el alta o baja de entidades, as&iacute; como realizar consultas o modificaciones de los datos de las entidades ya existentes. Esta pantalla permite tambi&eacute;n la realizaci&oacute;n de b&uacute;squedas filtradas de entidades.<br><br>
	El mantenimiento de las entidades requiere el acceso con un usuario que disponga del rol de '<i>Superadministrador</i>'.
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">C&oacute;digo DIR3:</span> c&oacute;digo DIR3 de la entidad. </li>
		<li><span class="nombreCampo">Nombre de la entidad:</span> nombre de la entidad.</li>
		<li><span class="nombreCampo">Activa:</span> indicar&aacute; si la entidad est&aacute; '<i>Activa</i>' dentro de la plataforma de tramitaci&oacute;n telem&aacute;tica.</li>
		<li><span class="nombreCampo">Rol de la entidad:</span> rol espec&iacute;fico que se le asignar&aacute; a la entidad. Este rol ser&aacute; el requerido por un '<i>Administrador de Entidad</i>' para llevar a cabo el mantenimiento de esta entidad.</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Buscar</span>: introduciendo un texto en el campo '<i>Buscar</i>' y pulsando el bot&oacute;n con el icono de la lupa se llevar&aacute; a cabo un filtraje de las entidades que contengan el texto introducido. El criterio de b&uacute;squeda aplicar&aacute; en cualquiera de los campos de la entidad. Posteriormente se visualizar&aacute;n los resultados de la b&uacute;squeda filtr&aacute;ndolo en el listado de entidades.</li>
		<li><span class="boton">Nuevo</span>: se abrir&aacute; la <a href="../../ayuda/es/entidadDialog.html">ficha</a> para dar de alta una nueva entidad en la que deber&aacute; cumplimentar los campos m&iacute;nimos solicitados.</li>
		<li><span class="boton">Editar</span>: seleccionando una entidad del listado y pulsando en el bot&oacute;n se abrir&aacute; la ficha para poder realizar las modificaciones de los campos deseados.</li>
		<li><span class="boton">Eliminar</span>: seleccionando una entidad del listado y pulsando sobre el bot&oacute;n  podr&aacute; suprimir una entidad existente. Previo a la eliminaci&oacute;n de la entidad se mostrar&aacute; un mensaje de confirmaci&oacute;n de la acci&oacute;n.</li>
	</ul>
</p>
</body>
</html>