<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">PLUGINS</h1>
<p>
	En la pantalla de '<i>Plugins</i>' se puede gestionar tanto el alta o baja de plugins como realizar consultas o modificaciones de los plugins ya existentes. Los plugins tienen un &aacute;mbito de aplicaci&Oacute;n, global o entidad, que se refiere a si aplican a nivel general de aplicaci&Oacute;n o solo para la entidad concreta. Cada tipo de plugin tiene un &aacute;mbito de aplicaci&Oacute;n concreto.<br><br>
	Esta pantalla permite la realizaci&oacute;n de b&uacute;squedas filtradas de plugins.<br><br>
	El mantenimento de plugins de &oacute;mbito global lo tiene que hacer un usuari que disponga del rol de '<i>Superadministrador</i>', en cambio los plugins de &aacute;mbito entidad tendr&aacute;n que ser mantenidos por un usuario con rol '<i>Administrador de entidad</i>' y el rol de la entidad correspondiente.
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Tipos plugin:</span> tipolog&iacute;a del plugin</li>
		<li><span class="nombreCampo">Classname:</span> classname de la clase implementadora del plugin</li>
		<li><span class="nombreCampo">Descripción:</span> texto descriptivo de la implementaci&oacute;n del plugin</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Buscar</span>: introduciendo un texto en el campo '<i>Buscar</i>' y pulsando el bot&oacute;n con el icono de la lupa se llevará a cabo un filtrado de los plugins que contengan el texto introducido. El criterio de b&uacute;squeda aplicar&aacute; en cualquiera de los campos del plugin. Posteriormente se visualizar&aacute;n los resultados de la b&uacute;squeda filtr&aacute;ndolos en el listado de plugins.</li>
		<li><span class="boton">Nuevo</span>: pulsando el bot&oacute;n se abrir&aacute; la <a href="../../ayuda/es/pluginDialog.html">ficha</a> para dar de alta un nuevo plugin en el que se tendr&aacute;n que rellenar los campos m&iacute;nimos solicitados.</li>
		<li><span class="boton">Editar</span>: seleccionando un plugin del listado y pulsando el bot&oacute;n se abrir&agrave; la ficha para poder realizar las modificaciones de los campos deseados.</li>
		<li> <span class="boton">Eliminar</span>: seleccionando un plugin del listado y pulsando el bot&oacute;n podr&aacute; suprimir un plugin existente. De manera previa a la eliminaci&oacute;n del plugin se mostrar&aacute; un mensaje de confirmaci&oacute;n de la acci&oacute;n.</li>
		<li> <span class="boton">Refrescar caché</span>: si cambia el valor de alguna propiedad tendrá que pulsar este bot&oacute;n para que se apliquen los cambios realizados.</li>
	</ul>
</p>
</body>
</html>