<html>
<head>
<link rel="stylesheet" href="../../ayuda/ayuda.css" type="text/css" />
</head>
<body>
<h1 class="stgH1">PROPIEDADES DE CONFIGURACI&Oacute;N GLOBAL</h1>
<p>
	En la pantalla de '<i>Propiedades de configuraci&oacute;n global</i>' puede realizar un mantenimento de las propiedades requeridas por la aplicación para su correcto funcionamiento. Esta pantalla no permite la creaci&oacute;n o eliminaci&oacute;n de propiedades, &uacute;nicamente permite la adaptaci&oacute;n de los valores de las propiedades existentes<br><br>
	El mantenimento de las propiedades de configuraci&oacute;n global de la aplicaci&oacute;n require el acceso con un usuario que disponga del rol de '<i>Superadministrador</i>'.
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">C&oacute;digo:</span> c&oacute;digo de la propiedad global. </li>
		<li><span class="nombreCampo">Valor:</span> valor de la propiedad global para la instalaci&oacute;n.</li>
		<li><span class="nombreCampo">Texto descriptivo del prop&oacute;sito de la propiedad global.</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Buscar</span>: introduciendo un texto en el campo '<i>Buscar</i>' y pulsando el bot&oacute;n con el icono de la lupa se llevar&aacute; a cabo un filtraje de las propiedades que contengan el text introducido. El criterio de b&uacute;squeda aplicar&aacute; en cualquiera de los campos de la de la propiedad. Posteriormente se visualizar&aacute;n los resultados de la b&uacute;squeda filtr&aacute;ndolo en el listado de de propiedades.</li>
		<li><span class="boton">Editar</span>: seleccionando una propiedad del listado y pulsando el bot&oacute;n se abrir&aacute; la <a href="../../ayuda/es/propiedadesConfiguracionDialog.html">ficha</a> para poder modificar el valor de la propiedad y adaptarlo a la instalaci&oacute;n.</li>
		<li> <span class="boton">Refrescar cach&eacute;</span>: si cambia el valor de alguna propiedad tendr&aacute; que pulsar este bot&oacute;n para que se apliquen los cambios realizados.</li>
	</ul>
</p>
</body>
</html>