<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">PROPIEDADES DEL FORMULARIO</h1>
<p>
	En la pantalla de '<i>Propiedades del formulario</i>' puede gestionar configuraciones del formulario relativas a la administraci&oacute;n de p&aacute;ginas y a la visualizaci&oacute;n del mismo.<br>
</p>
<h2 class="stgH2">CAMPOS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Cabecera del formulario:</span> muestra la descripción del formulario, que aparece en el formulario y PDF desde el asistente de tramitación.</li>
		<li><span class="nombreCampo">Adm. p&aacute;ginas:</span> listado que presenta las p&aacute;ginas del formulario y permite realizar una gesti&oacute;n de las mismas. En este listado se visualiza el nombre de la p&aacute;gina y si tiene o no la condici&oacute;n de final. Las opciones disponibles son:</li>
		<ul class="detalle">
		<li><span class="boton">Nuevo:</span> permite dar de alta una nueva p&aacute;gina en el formulario. Dicha p&aacute;gina se crear&aacute; inmediatamente a continuaci&oacute;n de la &uacute;ltima existente.</li>
		<li><span class="boton">Editar:</span> al pulsar este bot&oacute;n se accede a una ficha de edici&oacute;n de las propiedades de la p&aacute;gina.</li>
		<li><span class="boton">Eliminar:</span> permite eliminar una p&aacute;gina existente previamente seleccionada.</li>
		<li><span class="boton">Subir:</span> permite subir la p&aacute;gina seleccionada en el orden del listado del p&aacute;ginas del formulario.</li>
		<li><span class="boton">Bajar:</span> permite bajar la p&aacute;gina seleccionada en el orden del listado del p&aacute;ginas del formulario.</li>
		</ul>
		<li><span class="nombreCampo">Plantillas visualizaci&oacute;n PDF:</span> listado de plantillas de visualizaci&oacute;n disponibles para la renderizaci&oacute;n del formulario a PDF. Estas plantillas han de estar basadas en un formateador existente. Las opciones disponibles para la gesti&oacute;n de las plantillas son:</li>
		<ul class="detalle">
		<li><span class="boton">Nuevo:</span> al pulsar este bot&oacute;n se accede a la ficha de alta de plantilla.</li>
		<li><span class="boton">Editar:</span> al pulsar este bot&oacute;n se accede a la ficha de edici&oacute;n de la plantilla.</li>
		<li><span class="boton">Eliminar:</span> permite eliminar una plantilla previamente definida.</li>
		<li><span class="boton">Plantillas por idioma:</span> al pulsar este bot&oacute;n se abrir&aacute; la ficha de edici&oacute;n de plantillas multidioma para la plantilla seleccionada. En esta ficha se pemitir&aacute; incorporar el fichero a utilizar como plantilla para cada idioma. Para obtener ayuda sobre el diseño de las plantillas, pulse <a href="AyudaServlet?lang=es&id=disenyoPlantillasVisualizacion">aquí</a></li>
		</ul>
		<li><span class="nombreCampo">Script plantillas de visualizaci&oacute;n PDF:</span> script que permite establecer la plantilla de visualizaci&oacute;n a utilizar, de las previamente definidas, seg&uacute;n diferentes valores del tr&aacute;mite (campos del formulario, datos de sesi&oacute;n, dominios, etc.).</li>
		<li><span class="nombreCampo">Permitir guardar sin finalizar:</span> Este check permite en los formularios multip&aacute;gina salir del formulario con la opci&oacute;n de guardar los datos introducidos hasta ese momento, sin necesidad de haber finalizado el tr&aacute;mite.</li>
		</ul>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Guardar</span>: cierra la pantalla guardando los cambios.</li>
		<li><span class="boton">Cancelar</span>: cierra la pantalla sin guardar los cambios.</li>
	</ul>
</p>
</body>
</html>