<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">TR&Aacute;MITES</h1>
<p>
	En la pantalla de '<i>Tr&aacute;mites</i>' se puede gestionar el alta, baja y edici&oacute;n de &aacute;reas, tr&aacute;mites y versiones de tr&aacute;mites.
	Adem&aacute;s se pueden realizar otras operativas relativas a tr&aacute;mite y versi&oacute;n de tr&aacute;mite que se detallan m&aacute;s abajo (Control de acceso, exportaci&oacute;n/importaci&oacute;n, mover tr&aacute;mite, etc.).<br>
	En esta pantalla &uacute;nicamente se visualizar&aacute;n las &aacute;reas y tr&aacute;mites, contenidos en estas, sobre las que el usuario tenga permisos. Sobre dichos tr&aacute;mites la pantalla permite la realizaci&oacute;n de b&uacute;quedas filtradas.<br><br>
	El mantenimiento de las &aacute;reas la ha de hacer un usuario que disponga del rol de '<i>Administrador de entidad</i>'.<br>
	El mantenimiento de tr&aacute;mites y versiones de un tr&aacute;mite vinculados a un &aacute;rea &uacute;nicamente puede ser realizado por un usuario que disponga del rol de '<i>Administrador de entidad</i>' o en su defecto por un usuario con rol '<i>Desarrollador</i>' con permisos de desarrollador sobre el &aacute;rea al que pertencen los tr&aacute;mites y o versiones de estos.
</p>
<h2 class="stgH2">OPERATIVA &Aacute;REAS</h2>
<p>
	<ul>
		<li><span class="boton">Nuevo</span>: pulsando en el bot&oacute;n se abrir&aacute; la <a href="AyudaServlet?lang=es&id=dominioDialog">ficha</a> para dar de alta un nueva &aacute;rea en la cual tendr&aacute; que rellenar los campos m&iacute;nimos solicitados. Esta operativa &uacute;nicamente estar&aacute; disponible para los administradores de entidad.</li>
		<li><span class="boton">Editar</span>: el bot&oacute;n de edici&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya un &aacute;rea seleccionada. Al pulsar dicho bot&oacute;n se abrir&aacute; la ficha para poder realizar las modificaciones de los campos deseados.</li>
		<li> <span class="boton">Eliminar</span>: el bot&oacute;n de eliminaci&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya un &aacute;rea seleccionada a eliminar. Previa a la eliminaci&oacute;n del &aacute;rea se mostrar&aacute; un mensaje de confirmaci&oacute;n de la acci&oacute;n. Esta operativa &uacute;nicamente estar&aacute; disponible para los administradores de entidad.</li>
	</ul>
</p>
<h2 class="stgH2">CAMPOS TR&Aacute;MITES</h2>
<p>
	<ul>
		<li><span class="nombreCampo">C&oacute;digo del tr&aacute;mite:</span> c&oacute;digo un&iacute;voco que identifica al tr&aacute;mite en la aplicaci&oacute;n</li>
		<li><span class="nombreCampo">Descripci&oacute;n del tr&aacute;mite:</span> texto descriptivo del objeto del tr&aacute;mite</li>
		<li><span class="nombreCampo">Versiones activas:</span> casilla de verificaci&oacute;n que indica si el tr&aacute;mite cuenta con versiones activas</li>
		<li><span class="nombreCampo">&Aacute;rea:</span> c&oacute;digo del &aacute;rea al que pertenece el tr&aacute;mite. Mediante este campo el usuario, con permiso sobre diferentes &aacute;reas, puede distinguir a qu&eacute; &aacute;rea pertenece el tr&aacute;mite</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA TR&Aacute;MITES</h2>
<p>
	<ul>
		<li><span class="boton">Buscar</span>: introduciendo un texto en el campo '<i>Buscar</i>' y pulsando el bot&oacute;n con el icono de la lupa se llevar&aacute; a cabo un filtrado de los tr&aacute;mites que contengan el texto introducido. El criterio de b&uacute;squeda aplicar&aacute; a cualquiera de los campos del tr&aacute;mite, y solo se buscar&aacute; sobre los tr&aacute;mites de las &aacute;reas marcadas. Posteriormente se visualizar&aacute;n los resultados de la b&uacute;squeda filtr&aacute;ndolos en el listado de tr&aacute;mites.</li>
		<li><span class="boton">Nuevo Tr&aacute;mite</span>: el bot&oacute;n de nuevo tr&aacute;mite &uacute;nicamente se mostrar&aacute; cuando haya un &aacute;rea seleccionada. Al pulsar el bot&oacute;n se abrir&aacute; la <a href="AyudaServlet?lang=es&id=dominioDialog">ficha</a> para dar de alta un nuevo tr&aacute;mite en la cual tendr&aacute; que rellenar los campos m&iacute;nimos solicitados para llevar a cabo el alta.</li>
		<li><span class="boton">Nueva Versi&oacute;n</span>: el bot&oacute;n de nueva versi&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite seleccionado. Al pulsar el bot&oacute;n se abrir&aacute; la ficha para indicar el n&uacute;mero de versi&oacute;n a crear y el tipo de flujo de dicha versi&oacute;n</li>
		<li><span class="boton">Editar Tr&aacute;mite</span>: el bot&oacute;n de edici&oacute;n de tr&aacute;mite &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite seleccionado en el listado. Al pulsar el bot&oacute;n se abrir&aacute; la <a href="AyudaServlet?lang=es&id=dominioDialog">ficha</a> para modificar el tr&aacute;mite.</li>
		<li><span class="boton">Nueva Versi&oacute;n</span>: el bot&oacute;n de nueva versi&oacute;n de tr&aacute;mite &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite seleccionado en el listado. Al pulsar el bot&oacute;n se abrir&aacute; la <a href="AyudaServlet?lang=es&id=dominioDialog">ficha</a> para dar de alta una nueva versi&oacute;n del tr&aacute;mite.</li>
		<li><span class="boton">Importar Versi&oacute;n</span>: el bot&oacute;n de importaci&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite o versi&oacute;n seleccionada, ya que lo que se importa es una versi&oacute;n. Al pulsar el bot&oacute;n se abrir&aacute; el asistente de importaci&oacute;n.</li>
		<li><span class="boton">Mover Tr&aacute;mite</span>: el bot&oacute;n de mover tr&aacute;mite &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite seleccionado. Al pulsar el bot&oacute;n se abrir&aacute; una ventana que nos permitir&aacute; indicar el &aacute;rea destino del tr&aacute;mite.</li>
		<li> <span class="boton">Eliminar Tr&aacute;mite</span>: el bot&oacute;n de eliminar tr&aacute;mite &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite seleccionado. Previo a la eliminaci&oacute;n del tr&aacute;mite se mostrar&aacute; un mensaje de confirmaci&oacute;n de la acci&oacute;n.</li>
		<li> <span class="boton">Procedimientos</span>: el bot&oacute;n de procedimientos &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite seleccionado. Al pulsar el bot&oacute;n se presentar&aacute; una ventana con el listado de procedimientos del cat&aacute;logo que tienen vinculado el tr&aacute;mite seleccionado.</li>
		<li> <span class="boton">Dominios &Aacute;rea</span>: este bot&oacute;n est&aacute; disponible cuando se selecciona una &uacute;nica &aacute;rea, y permite acceder al listado de dominios del &aacute;rea seleccionada.</li>
		<li> <span class="boton">Fuentes de Datos &Aacute;rea</span>: este bot&oacute;n est&aacute; disponible cuando se selecciona una &uacute;nica &aacute;rea, y permite acceder al listado de fuentes de datos del &aacute;rea seleccionada.</li>
	</ul>
</p>
<h2 class="stgH2">CAMPOS VERSI&Oacute;N</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Versi&oacute;n:</span> c&oacute;digo un&iacute;voco que identifica al tr&aacute;mite en la aplicaci&oacute;n</li>
		<li><span class="nombreCampo">Flujo:</span> texto descriptivo del objeto del tr&aacute;mite</li>
		<li><span class="nombreCampo">Activa:</span> casilla de verificaci&oacute;n que indica si el tr&aacute;mite cuenta con versiones activas</li>
		<li><span class="nombreCampo">Release:</span> c&oacute;digo que identifica un&iacute;vocamente un conjunto de cambios realizados sobre una versi&oacute;n</li>
		<li><span class="nombreCampo">Bloqueado por:</span> indica el c&oacute;digo de usuario que tiene bloqueada para edici&oacute;n la versi&oacute;n</li>
		<li><span class="nombreCampo">Huella:</span> c&oacute;digo aleatorio que se genera cada vez que el usuario desbloquea una versi&oacute;n</li>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA VERSI&Oacute;N</h2>
<p>
	<ul>
		<li><span class="boton">Nueva Versi&oacute;n</span>: el bot&oacute;n de nueva versi&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite seleccionado. Al pulsar el bot&oacute;n se abrir&aacute; la ficha para indicar el n&uacute;mero de versi&oacute;n a crear y el tipo de flujo de dicha versi&oacute;n</li>
		<li><span class="boton">Editar Versi&oacute;n</span>: el bot&oacute;n de edici&oacute;n de versi&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n de un tr&aacute;mite seleccionada. Al pulsar el bot&oacute;n se acceder&aacute; a la definici&oacute;n de versi&oacute;n, que &uacute;nicamente ser&aacute; editable si previamente se ha bloqueado.</li>
		<li><span class="boton">Bloquear</span>: el bot&oacute;n de bloqueo de versi&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n de un tr&aacute;mite seleccionada. Al pulsar el bot&oacute;n la versi&oacute;n quedar&aacute; bloqueada por el usuario, de manera que solo &eacute;l pueda editar la versi&oacute; hasta que esta sea desbloqueada.</li>
		<li><span class="boton">Desbloquear</span>: el bot&oacute;n de desbloqueo de versi&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n de un tr&aacute;mite seleccionada que est&eacute; bloqueada por un usuario. Una versi&oacute;n bloqueada &uacute;nicamente podr&aacute; ser desbloqueada por &eacute;l mismo o por un administrador de &aacute;rea y/o entidad.</li>
		<li><span class="boton">Previsualizar Versi&oacute;n</span>: el bot&oacute;n de previsualizaci&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n de un tr&aacute;mite seleccionada. Al pulsar el bot&oacute;n se abrir&aacute; una ventana que nos permitir&aacute; realizar una previsualizaci&oacute;n, en el asistente de tramitaci&oacute;n, de la versi&oacute;n del tr&aacute;mite.</li>
		<li><span class="boton">Control de acceso</span>: el bot&oacute;n de control de acceso &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n de un tr&aacute;mite seleccionada. Al pulsar el bot&oacute;n se abrir&aacute; una ventana que nos permitir&aacute; modificar par&aacute;metros relativos al acceso a la versi&oacute;n del tr&aacute;mite desde el asistente de tramitaci&oacute;n.</li>
		<li><span class="boton">Historial</span>: el bot&oacute;n de historial &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n de un tr&aacute;mite seleccionada. Al pulsar el bot&oacute;n se abrir&aacute; una ventana en el que se muestra el hist&oacute;rico de releases de la versi&oacute;n, con el detalle de cada release.</li>
		<li><span class="boton">Eliminar versi&oacute;n</span>: el bot&oacute;n de eliminar versi&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n seleccionada. Previo a la eliminaci&oacute;n de la versi&oacute;n se mostrar&aacute; un mensaje de confirmaci&oacute;n de la acci&oacute;n.</li>
		<li><span class="boton">Exportar versi&oacute;n</span>: el bot&oacute;n de exportaci&oacute;n de versi&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n seleccionada. Para poder exportar una versi&oacute;n de tr&aacute;mite, esta deber&aacute; estar desbloqueada. Al pulsar el bot&oacute;n se presentar&aacute; una ventana con un resumen de los datos de la versi&oacute;n a exportar que permitir&aacute; generar el fichero de exportaci&oacute;n.</li>
		<li><span class="boton">Duplicar versi&oacute;n</span>: el bot&oacute;n de duplicaci&oacute;n &uacute;nicamente se mostrar&aacute; cuando haya una versi&oacute;n de un tr&aacute;mite seleccionada. Al pulsar el bot&oacute;n se abrir&aacute; una ventana que permitir&aacute; fijar el &aacute;rea y tr&aacute;mite en el que se duplicar&aacute; la versi&oacute;n. Es importante tener en cuenta que la versi&oacute;n se duplicar&aacute; en el tr&aacute;mite destino con un n&uacute;mero de versi&oacute;n inmediatamente superior a la versi&oacute;n m&aacute;s reciente.</li>
		<li><span class="boton">Procedimientos</span>: el bot&oacute;n de procedimientos &uacute;nicamente se mostrar&aacute; cuando haya un tr&aacute;mite seleccionado. Al pulsar el bot&oacute;n se presentar&aacute; una ventana con el listado de procedimientos del cat&aacute;logo que tienen vinculado el tr&aacute;mite seleccionado.</li>
		<li><span class="boton">Dominios &Aacute;rea</span>: este bot&oacute;n est&aacute; disponible cuando se selecciona una &uacute;nica &aacute;rea, y permite acceder al listado de dominios del &aacute;rea seleccionada.</li>
		<li><span class="boton">Fuentes de Datos &Aacute;rea</span>: este bot&oacute;n est&aacute; disponible cuando se selecciona una &uacute;nica &aacute;rea, y permite acceder al listado de fuentes de datos del &aacute;rea seleccionada.</li>
	</ul>
</p>
</body>
</html>