<html>
<head>
	<meta charset=UTF-8>
	<meta http-equiv="content-type" content="text/html; utf-8">
	<link rel="stylesheet" href="AyudaServlet?css=ayuda" type="text/css" />
</head>
<body>
<h1 class="stgH1">PREVISUALIZAR VERSI&Oacute;N</h1>
<p>
	En la pantalla de '<i>Previsualizar versi&oacute;n</i>' se permite configurar las opciones para la previsualizaci&oacute;n, en el asistente de tramitaci&oacute;n, de la versi&oacute;n del tr&aacute;mite.<br>
</p>
<h2 class="stgH2">CAMPS</h2>
<p>
	<ul>
		<li><span class="nombreCampo">Idioma:</span> permite seleccionar el idioma en que se visualizar&aacute; la versi&oacute;n en el asistente.</li>
		<li><span class="nombreCampo">Tr&aacute;mite:</span> desplegable en el que se ha de indicar a qu&eacute; tr&aacute;mite del cat&aacute;logo de procedimientos se vincula la versi&oacute;n del tr&aacute;mite a previsualizar. Esta vinculaci&oacute;n es requerida para la recuperaci&oacute;n de datos del tr&aacute;mite del cat&aacute;logo de procedimientos.</li>
		<ul class="detalle">
		<li><span class="boton">Incorporados en SIA:</span> Al marcar este check se carga autom&aacute;ticamente el listado de Tr&aacute;mites de Procedimientos Administrativos que tengan un c&oacute;digo SIA asociado, eliminando del listado los marcados con (S), por no estar incluidos en SIA y no poder previsualizarse.</li>
		<li><span class="boton">Vigentes:</span> Al marcar este check se carga autom&aacute;ticamente el listado de Tr&aacute;mites de Procedimientos Administrativos que est&eacute;n vigentes, seg&uacute;n su fecha de publicaci&oacute;n y la de caducidad, eliminando del listado los marcados con (V), por no estar vigentes actualmente y no poder previsualizarse.</li>
		<li><span class="boton">P&uacute;blicos:</span> Al marcar este check se carga autom&aacute;ticamente el listado de Tr&aacute;mites de Procedimientos Administrativos que sean P&uacute;blicos (P) y no aparecer&aacute;n los Internos (I) ni los que est&eacute;n Reservados (R).</li>
		<li><span class="boton">Simular tramitaci&oacute;n:</span> Al marcar este check no se est&aacute; asociando la previsualizaci&oacute;n a ningun tr&aacute;mite del Cat&aacute;logo de Procedimientos, por lo que no se podr&aacute; registrar.</li>
		</ul>
		<li><span class="nombreCampo">Par&aacute;metros:</span> lista de par&aacute;metros a añadir a la URL para la previsualizaci&oacute;n del tr&aacute;mite. Respecto a estos par&aacute;metros se puede llevar a cabo las operaciones siguiente:</li>
		<ul class="detalle">
		<li><span class="boton">Nuevo:</span> permite incorporar un nuevo par&aacute;metro y el valor a asignarle</li>
		<li><span class="boton">Editar:</span> permite editar un par&aacute;metro existente previamente seleccionado.</li>
		<li><span class="boton">Eliminar:</span> permite eliminar un par&aacute;metro existente previamente seleccionado.</li>
		</ul>
	</ul>
</p>
<h2 class="stgH2">OPERATIVA</h2>
<p>
	<ul>
		<li><span class="boton">Previsualizar versi&oacute;n</span>: lanza la previsualizaci&oacute;n del tr&aacute;mite en una nueva pestaña del navegador. Es importante verificar que el navegador utilizado no tenga bloqueado el mostrado de ventanas emergentes.</li>
		<li><span class="boton">Cancelar</span>: cierra la ventana sin lanzar la previsualizaci&oacute;n.</li>
	</ul>
</p>
</body>
</html>